{"file": "r251016b.pdf", "para_id": 0, "text": "For release on delivery 12:20 p.m. EDT October 14, 2025 Understanding the Fed’s Balance Sheet Remarks by Jerome H. Powell Chair Board of Governors of the Federal Reserve System at the 67th Annual Meeting of the National Association for Business Economics Philadelphia, Pennsylvania October 14, 2025 Thank you, Emily. And thank you to the National Association for Business Economics for the Adam Smith Award. It is an honor just to be mentioned alongside past recipients, including my predecessors Janet Yellen and Ben Bernanke. Thank you for this recognition and for the opportunity to speak with you today. Monetary policy is more effective when the public understands what the Federal Reserve does and why. With that in mind, I hope to enhance understanding of one of the more arcane and technical aspects of monetary policy: the Federal Reserve’s balance sheet. A colleague recently compared this topic to a trip to the dentist, but that comparison may be unfair—to dentists. 1 Today, I will discuss the essential role our balance sheet played during the pandemic, along with some lessons learned. I will then review our ample reserves implementation framework and the progress we have made toward normalizing the size of our balance sheet. I will conclude with some brief remarks on the economic outlook. Background on the Fed’s Balance Sheet One of the primary purposes of a central bank is to provide the monetary foundation for the financial system and the broader economy. This foundation is made of central bank liabilities. On the Fed’s balance sheet, the liability side of the ledger totaled $6.5 trillion as of October 8, and three categories account for roughly 95 percent of that total. 2 First, Federal Reserve notes— that is, physical currency—totaled $2.4 trillion. Second, reserves—funds held by depository institutions at the Federal Reserve Banks — 1 See Christopher J. Waller (2025), “Demystifying the Federal Reserve's Balance Sheet,” speech delivered at the Federal Reserve Bank of Dallas, Dallas, Texas, July 10, https://www.federalreserve.gov/newsevents/speech/waller20250710a.htm. 2 For details discussed below, see Board of Governors of the Federal Reserve System (2025), Statistical Release H.4.1, “Factors Affecting Reserve Balances of Depository Institutions and Condition Statement of Federal Reserve Banks” (October 9), https://www.federalreserve.gov/releases/h41/20251009/h41.pdf."}
{"file": "r251016b.pdf", "para_id": 1, "text": "- 2 - totaled $3.0 trillion. These deposits allow commercial banks to make and receive payments and meet regulatory requirements. Reserves are the safest and most liquid asset in the financial system, and only the Fed can create them. The adequate provision of reserves is essential to the safety and soundness of our banking system, the resilience and efficiency of our payments system, and ultimately the stability of our economy. Third is the Treasury General Account (TGA), currently at about $800 billion, which essentially is the checking account for the federal government. When the Treasury makes or receives payments, those flows affect dollar-for-dollar the supply of reserves or other liabilities in the system. 3 The asset side of our ledger consists almost entirely of securities, including $4.2 trillion of U.S. Treasury securities and $2.1 trillion of government-guaranteed agency mortgage-backed securities (MBS).4 When we add reserves to the system, we generally do so by purchasing Treasury securities in the open market and crediting the reserve accounts of the banks involved in the transaction with the seller. This process effectively transforms securities held by the public into reserves but does not change the total amount of government liabilities held by the public.5 3 Other liabilities include reverse repurchase agreements and accounts held by designated financial market utilities, foreign central banks, and international financial institutions. 4 Within its securities portfolio, the Federal Reserves also holds $2.3 billion in government agency debt. 5 In 2021, the standing repo facility was established to serve as a backstop in money markets to support the effective implementation of monetary policy and smooth market functioning. It is available to provide liquidity to primary dealers and eligible depository institutions through overnight repurchase agreements. The Federal Reserve also maintains U.S. dollar liquidity swap lines with several major central banks to prevent strains in global dollar funding markets from spilling over into domestic markets. The Foreign and International Monetary Authorities Repo Facility also is a source of dollar liquidity for approved foreign central banks and international monetary authorities. Beyond securities, the Fed maintains lending facilities that serve as crucial backstops for the banking system. The loans we make through these facilities show up as assets on our balance sheet, with the corresponding liability typically being reserves. Our discount window provides no-questions-asked liquidity to eligible depository institutions. In unusual and exigent circumstances, we may establish emergency liquidity facilities, in consultation with the Secretary of the Treasury. These facilities have demonstrated their critical importance in times of stress."}
{"file": "r251016b.pdf", "para_id": 2, "text": "- 3 - The Balance Sheet Is an Important Tool The Fed’s balance sheet serves as a critical policy tool, especially when the policy rate is constrained by the effective lower bound (ELB). When COVID-19 struck in March 2020, the economy came to a near standstill and financial markets seized up, threatening to transform a public health crisis into a severe, prolonged economic downturn. In response, we established a number of emergency liquidity facilities. Those programs, supported by Congress and the Administration, provided critical support to markets and were remarkably effective in restoring confidence and stability. At their peak in July 2020, loans from these facilities totaled just over $200 billion. Most of these loans were quickly unwound as conditions stabilized. 6 At the same time, the market for U.S. Treasury securities—normally the deepest, most liquid market in the world and the bedrock of the global financial system—was under extraordinary pressure and on the verge of collapse. We used large-scale purchases of securities to restore functionality to the Treasury market. Faced with unprecedented market dysfunction, the Fed purchased Treasury and agency securities at an extraordinary pace in March and April of 2020. These purchases supported the flow of credit to households and businesses and fostered more accommodative financial conditions to 6 The combined peak in balances across these facilities occurred in July 2020 at just above $200 billion, including loans totaling $2.5 billion by the Primary Dealer Credit Facility, $20.6 billion by the Money Market Mutual Fund Liquidity Facility, $68.1 billion by the Paycheck Protection Program Liquidity Facility (PPPLF), $12.8 billion by the Commercial Paper Funding Facility, $41.4 billion by the Corporate Credit Facilities, $37.5 billion by the Main Street Lending Program (MSLP), $16.1 billion by the Municipal Liquidity Facility, and $8.8 billion by the Term Asset-Backed Securities Loan Facility; see Board of Governors of the Federal Reserve System (2020), Statistical Release H.4.1, “Factors Affecting Reserve Balances of Depository Institutions and Condition Statement of Federal Reserve Banks” (July 2), https://www.federalreserve.gov/releases/h41/20200702. At present, the only remaining balances from the pandemic-era emergency lending facilities are $75 million in the PPPLF and $4.1 billion in the MSLP. All other emergency lending facilities have already been fully repaid."}
{"file": "r251016b.pdf", "para_id": 3, "text": "- 4 - support the recovery of the economy when it ultimately came.7 This source of policy accommodation was important as we had lowered the federal funds rate close to zero and expected it to remain there for some time. By June 2020, we slowed our purchase pace to a still substantial $120 billion per month. In December 2020, as the economic outlook remained highly uncertain, the FOMC said that we expected to maintain that pace of purchases “until substantial further progress has been made toward the Committee’s maximum employment and price stability goals.”8 That guidance provided assurance that the Fed would not prematurely withdraw support while the economic recovery remained fragile amid unprecedented conditions. We maintained that pace of asset purchases through October 2021. By then, it had become apparent that elevated inflation was not likely to go away without a strong monetary response. At our meeting in November 2021, we announced a phaseout of asset purchases. At our next meeting in December, we doubled the pace of the taper and said that asset purchases would conclude by mid-March of 2022. Over the entire period of purchases, our securities holdings increased by $4.6 trillion. A number of observers have raised questions, fairly enough, about the size and composition of asset purchases during the pandemic recovery. 9 Throughout 2020 and 7 See Jerome H. Powell (2020), “Transcript of Chair Powell’s Press Conference” (Washington: Board of Governors of the Federal Reserve System, April 29), https://www.federalreserve.gov/mediacenter/files/FOMCpresconf20200429.pdf. 8 See Board of Governors of the Federal Reserve System (2020), “Federal Reserve Issues FOMC Statement,” press release, December 16, paragraph 4, https://www.federalreserve.gov/newsevents/pressreleases/monetary20201216a.htm. 9 See, for example, Gauti B. Eggertsson and Donald Kohn (2023), “The Inflation Surge of the 2020s: The Role of Monetary Policy,” Hutchins Center Working Paper 87 (Washington: Hutchins Center on Fiscal & Monetary Policy, Brookings Institution, August), https://www.brookings.edu/articles/the-inflation-surge- of-the-2020s-the-role-of-monetary-policy; William B. English and Brian Sack (2024), “Challenges around the Federal Reserve’s Monetary Policy Framework and Its Implementation,” Brookings Papers on"}
{"file": "r251016b.pdf", "para_id": 4, "text": "- 5 - 2021, the economy continued to face significant challenges as successive waves of COVID caused widespread disruption and loss. During that tumultuous period, we continued purchases in order to avoid a sharp, unwelcome tightening of financial conditions at a time when the economy still appeared to be highly vulnerable. Our thinking was informed by recent episodes in which signals about reducing the balance sheet had triggered significant tightening in financial conditions. We were thinking of events of December 2018, as well as the 2013 “taper tantrum.” 10 Regarding the composition of our purchases, some have questioned the inclusion of agency MBS purchases given the strong housing market during the pandemic recovery. 11 Outside of purchases aimed specifically at market functioning, MBS purchases are primarily intended, like our purchases of Treasury securities, to ease broader financial conditions when the policy rate is constrained at the ELB. 12 The extent to which these MBS purchases disproportionately affected housing market conditions during this period is challenging to determine. Many factors affect the mortgage market, Economic Activity, Fall, pp. 3–26, https://www.brookings.edu/wp- content/uploads/2024/09/1.a_EnglishSack.pdf; (2024), “General Discussion,” Brookings Papers on Economic Activity, Fall, pp. 88–92, https://www.brookings.edu/wp-content/uploads/2024/09/17160- BPEA-BPEA-FA24_WEB_Symposium_GD.pdf; and Andrew T. Levin, Brian L. Lu, and William R. Nelson (2022), “Quantifying the Costs and Benefits of Quantitative Easing,” Economics Working Paper 22128 (Stanford, Calif.: Hoover Institution, December), https://www.hoover.org/sites/default/files/research/docs/22128-Levin-Lu-Nelson.pdf.. 10 In December 2018, financial markets experienced significant volatility and equity prices dropped notably. While multiple factors were in play, many market participants pointed to the description of the Fed’s quantitative tightening as being on “autopilot” as exacerbating the turmoil. The “taper tantrum” was a sharp market selloff in 2013 when Chair Ben Bernanke suggested the Fed might soon reduce its asset purchases, causing Treasury yields to spike and triggering volatility in financial markets. 11 See, for example, Aaron Klein and Alan Cui (2025), “Quantitative Easing and Housing Inflation Post- COVID,” Series on Financial Markets and Regulation, Brookings Center on Regulations and Markets, October 8, https://www.brookings.edu/articles/quantitative-easing-and-housing-inflation-post-covid. 12 See, for example, Chair Bernanke’s description of the operation of balance sheet tools as part of his discussion of monetary policy in the post–Global Financial Crisis (GFC) environment: Ben S. Bernanke (2012), “Monetary Policy since the Onset of the Crisis,” speech delivered at a symposium sponsored by the Federal Reserve Bank of Kansas City, held in Jackson Hole, Wyo., August 31, https://www.federalreserve.gov/newsevents/speech/files/bernanke20120831a.pdf."}
{"file": "r251016b.pdf", "para_id": 5, "text": "- 6 - and many factors beyond the mortgage market affect supply and demand in the broader housing market.13 With the clarity of hindsight, we could have—and perhaps should have — stopped asset purchases sooner. Our real-time decisions were intended to serve as insurance against downside risks. We knew that we could unwind purchases relatively quickly once we ended them, which is exactly what we did. Research and experience tell us that asset purchases affect the economy through expectations regarding the future size and duration of our balance sheet. 14 When we announced our taper, market participants began pricing in its effects, pulling forward the tightening in financial conditions.15 Stopping sooner could have made some difference, but not likely enough to fundamentally alter the trajectory of the economy. Nonetheless, our experience since 2020 does suggest that we can be more nimble in our use of the balance sheet, and more confident that our communications will foster appropriate expectations among market participants given their growing experience with these tools. 13 Research indicates that house price increases during this time reflected factors well beyond mortgage rates. For example, Mondragon and Wieland (2022) estimate that the shift to remote work explains approximately one-half of the rise in house prices during the pandemic; for more details, see John A. Mondragon and Johannes Wieland (2022), “Housing Demand and Remote Work,” NBER Working Paper Series 30041 (Cambridge, Mass.: National Bureau of Economic Research, May; revised May 2025), https://www.nber.org/system/files/working_papers/w30041/w30041.pdf. 14 See, for example, Mark Carlson, Stefania D’Amico, Cristina Fuentes-Albero, Bernd Schlusche, and Paul Wood (2020), “Issues in the Use of the Balance Sheet Tool,” Finance and Economics Discussion Series 2020-071 (Washington: Board of Governors of the Federal Reserve System, August), https://doi.org/10.17016/FEDS.2020.071. 15 Even before the taper in purchases was completed in 2022, markets were anticipating the rapid decline in the size of the balance sheet that we subsequently delivered. Those expectations were formed based on our communications, even though the anticipated pace was three times faster than our experience from 2017 to 2019. For example, the median respondents to the Survey of Primary Dealers in June 2022 anticipated that the size of the System Open Market Account (SOMA) portfolio would ultimately fall by more than $2 trillion in less than three years, from its mid-2022 level of $8.5 trillion to $6.25 trillion by 2025:Q1. See question 3b in the June 2022 dealer survey results: Federal Reserve Bank of New York, Markets Group (2022), “Responses to Survey of Primary Dealers,” June, https://www.newyorkfed.org/medialibrary/media/markets/survey/2022/jun-2022-spd-results.pdf."}
{"file": "r251016b.pdf", "para_id": 6, "text": "- 7 - Some have also argued that we could have better explained the purpose of asset purchases in real time.16 There is always room for improved communication. But I believe our statements were reasonably clear about our objectives, which were to support and then sustain smooth market functioning and to help foster accommodative financial conditions. Over time, the relative importance of those objectives evolved with economic conditions. But the objectives were never in conflict, so at the time this issue appeared to be a distinction without much of a difference. That is not always the case, of course. For example, the March 2023 banking stress led to a sizable increase in our balance sheet through lending operations. We clearly differentiated these financial stability operations from our monetary policy stance. Indeed, we continued to raise the policy rate through that time. Our Ample Reserves Framework Works Well Turning to my second topic, our ample reserves regime has proven highly effective, delivering good control of our policy rate across a wide range of challenging economic conditions, while promoting financial stability and supporting a resilient payments system. 17 16 See William B. English and Brian Sack (2024), “Challenges around the Federal Reserve’s Monetary Policy Framework and Its Implementation,” Brookings Papers on Economic Activity, Fall, pp. 3–26, https://www.brookings.edu/wp-content/uploads/2024/09/1.a_EnglishSack.pdf, as well as Donald Kohn (2025), “Fed Should Be Sure to Include Monetary Policy Tools in Forthcoming Framework Review,” Brookings Commentary, January 24, https://www.brookings.edu/articles/fed-should-be-sure-to-include- monetary-policy-tools-in-forthcoming-framework-review. 17 By contrast, before the GFC, the Fed implemented monetary policy through a fundamentally different approach, a scarce reserves regime. This system relied on complicated reserve requirements to stabilize reserve demand, as the Fed did not have the authority to pay interests on reserves. Because banks did not receive interest on reserves, they engaged in a variety of costly activities to minimize their reserve requirements. To hit the federal funds rate target, the Fed had to conduct daily open market operations to fine-tune reserve supply. That approach was operationally burdensome for both depository institutions and the Federal Reserve. It minimized systemwide liquidity consistent with the federal funds target rate, thus making the banking system more vulnerable to shocks. Unexpected swings in reserve demand at times led to excess volatility in short-term interest rates. In this scarce regime, banks relied more heavily on"}
{"file": "r251016b.pdf", "para_id": 7, "text": "- 8 - In this framework, an ample supply of reserves ensures adequate liquidity in the banking system, and control of our policy rate is achieved through the setting of our administered rates— interest on reserve balances and the overnight reverse repo rate. This approach allows us to maintain rate control independently of the size of our balance sheet. That is important given large, unpredictable swings in liquidity demand from the private sector and significant fluctuations in autonomous factors affecting reserve supply, such as the Treasury General Account. This framework has proven resilient whether the balance sheet is shrinking or growing. Since June 2022, we have reduced the size of our balance sheet by $2.2 trillion—from 35 percent to just under 22 percent of GDP —while maintaining effective interest rate control. 18 Our long-stated plan is to stop balance sheet runoff when reserves are somewhat above the level we judge consistent with ample reserve conditions.19 We may approach that point in coming months, and we are closely monitoring a wide range of indicators to inform this decision. 20 Some signs have begun to emerge that liquidity conditions are unsecured borrowing from other financial institutions— funding that can rapidly evaporate in times of stress, as was evident in the GFC. 18 In January 2022, the FOMC released its “Principles for Reducing the Size of the Federal Reserve’s Balance Sheet,” followed in May by more detailed plans for doing so; see Board of Governors of the Federal Reserve System (2022), “Principles for Reducing the Size of the Federal Reserve’s Balance Sheet,” press release, January 26, https://www.federalreserve.gov/newsevents/pressreleases/monetary20220126c.htm; and Board of Governors of the Federal Reserve System (2022), “Plans for Reducing the Size of the Federal Reserve’s Balance Sheet,” May 4, press release, https://www.federalreserve.gov/newsevents/pressreleases/monetary20220504b.htm. 19 Once balance sheet runoff has ceased, reserve balances will continue to gradually decline as other Federal Reserve liabilities grow over time. At some point, the Committee will determine that reserve balances have reached an appropriately ample level. Thereafter, the Committee will manage securities holdings as needed to maintain ample reserves over time. 20 While reserves appear to remain abundant, they are declining and will continue to do so. Since we began shrinking our balance sheet in 2022, the quantity of reserves has not changed much as the excess liquidity in the system was absorbed and then subsequently released by our overnight reverse repo facility. Now, however, balances in that facility have declined to minimal levels, so further declines in our securities holdings will translate more directly into lower reserves. Currently, reserve balances stand just below $3"}
{"file": "r251016b.pdf", "para_id": 8, "text": "- 9 - gradually tightening, including a general firming of repo rates along with more noticeable but temporary pressures on selected dates. The Committee’s plans lay out a deliberately cautious approach to avoid the kind of money market strains experienced in September 2019. Moreover, the tools of our implementation framework, including the standing repo facility and the discount window, will help contain funding pressures and keep the federal funds rate within our target range through this transition to lower reserve levels. Normalizing the size of our balance sheet does not mean going back to the balance sheet we had before the pandemic. In the longer run, the size of our balance sheet is determined by the public’s demand for our liabilities rather than our pandemic-related asset purchases. Non-reserve liabilities currently stand about $1.1 trillion higher than just prior to the pandemic, thus requiring that our securities holdings be equally higher. Demand for reserves has risen as well, in part reflecting the growth of the banking system and the overall economy. Regarding the composition of our securities portfolio, relative to the outstanding universe of Treasury securities, our portfolio is currently overweight longer-term securities and underweight shorter-term securities. The longer-run composition will be a topic of Committee discussion. Transition to our desired composition will occur gradually and predictably, giving market participants time to adjust and minimizing the risk of market disruption. Consistent with our longstanding guidance, we aim for a portfolio consisting primarily of Treasury securities over the longer run. 21 trillion, or about 10 percent of GDP. By comparison, reserves as a share of GDP stood near 8 percent of GDP in early 2019, prior to the acute funding pressures that emerged later that year. Note that reserves as a share of GDP is merely indicative, not a measure of the ampleness of reserves. Assessments of where reserves stand relative to ample levels depend on a wide range of market indicators. 21 As noted in the minutes of the May 2022 FOMC meeting, the Committee could, at some point, consider sales of agency MBS to accelerate progress toward a longer-run SOMA portfolio composed primarily of Treasury securities; see Federal Open Market Committee (2022), “Minutes of the Federal Open Market"}
{"file": "r251016b.pdf", "para_id": 9, "text": "- 10 - Some have questioned whether the interest we pay on reserves is costly to taxpayers. In fact, that is not the case. The Fed earns interest income from the Treasury securities that back reserves. Most of the time, our interest earnings from Treasury holdings more than cover the interest paid on reserves, generating significant remittances to the Treasury. By law, we remit all profits to the Treasury after covering expenses. Since 2008, even after accounting for the recent period of negative net income, our total remittances to Treasury have totaled more than $900 billion. While our net interest income has temporarily been negative due to the rapid rise in policy rates to control inflation, this is highly unusual. Our net income will soon turn positive again, as it typically has been throughout our history. Of course, having negative net income has no bearing on our ability to conduct monetary policy or meet our financial obligations. 22 If our ability to pay interest on reserves and other liabilities were eliminated, the Fed would lose control over rates. The stance of monetary policy would no longer be appropriately calibrated to economic conditions and would push the economy away from our employment and price stability goals. To restore rate control, large sales of securities over a short period of time would be needed to shrink our balance sheet and the quantity of reserves in the system. The volume and speed of these sales could strain Treasury market functioning and compromise financial stability. Market participants would need to absorb the sales of Treasury securities and agency MBS, which would put upward Committee” (Washington: FOMC, May 3–4), https://www.federalreserve.gov/monetarypolicy/files/fomcminutes20220504.pdf. 22 See, for example, Alyssa Anderson, Dave Na, Bernd Schlusche, and Zeynep Senyuz (2022), “An Analysis of the Interest Rate Risk of the Federal Reserve’s Balance Sheet, Part 1: Background and Historical Perspective,” FEDS Notes (Washington: Board of Governors of the Federal Reserve System, July 15), https://doi.org/10.17016/2380-7172.3173; and Alyssa Anderson, Philippa Marks, Dave Na, Bernd Schlusche, and Zeynep Senyuz (2022), “An Analysis of the Interest Rate Risk of the Federal Reserve's Balance Sheet, Part 2: Projections under Alternative Interest Rate Paths,” FEDS Notes (Washington: Board of Governors of the Federal Reserve System, July 15), https://doi.org/10.17016/2380-7172.3174."}
{"file": "r251016b.pdf", "para_id": 10, "text": "- 11 - pressure on the entire yield curve, raising borrowing costs for the Treasury and the private sector. Even after that volatile and disruptive process, the banking system would be less resilient and more vulnerable to liquidity shocks. The bottom line is that our ample reserves regime has proven remarkably effective for implementing monetary policy and supporting economic and financial stability. Current Economic Conditions and Monetary Policy Outlook I will close with a brief discussion of the economy and the outlook for monetary policy. Although some important government data have been delayed due to the shutdown, we routinely review a wide variety of public- and private-sector data that have remained available. We also maintain a nationwide network of contacts through the Reserve Banks who provide valuable insights, which will be summarized in tomorrow’s Beige Book. Based on the data that we do have, it is fair to say that the outlook for employment and inflation does not appear to have changed much since our September meeting four weeks ago. Data available prior to the shutdown, however, show that growth in economic activity may be on a somewhat firmer trajectory than expected. While the unemployment rate remained low through August, payroll gains have slowed sharply, likely in part due to a decline in labor force growth due to lower immigration and labor force participation. In this less dynamic and somewhat softer labor market, the downside risks to employment appear to have risen. While official employment data for September are delayed, available evidence suggests that both - 12 - layoffs and hiring remain low, and that both households’ perceptions of job availability and firms’ perceptions of hiring difficulty continue their downward trajectories.23 Meanwhile, 12-month core PCE inflation was 2.9 percent in August, up slightly from earlier this year, as rising core goods inflation has outpaced continued disinflation in housing services. Available data and surveys continue to show that goods price increases primarily reflect tariffs rather than broader inflationary pressures. Consistent with these effects, near-term inflation expectations have generally increased this year, while most longer-term expectation measures remain aligned with our 2 percent goal. Rising downside risks to employment have shifted our assessment of the balance of risks. As a result, we judged it appropriate to take another step toward a more neutral policy stance at our September meeting. There is no risk-free path for policy as we navigate the tension between our employment and inflation goals. This challenge was evident in the dispersion of Committee participants’ projections at the September meeting. I will stress again that these projections should be understood as representing a range of potential outcomes whose probabilities evolve as new information informs our meeting-by-meeting approach to policymaking. We will set policy based on the evolution of the economic outlook and the balance of risks, rather than following a predetermined path. Thank you again for this award and for inviting me to join you today. I look forward to our conversation. 23 State-level data on unemployment insurance claims during September remain available, as do some non- governmental statistics on job openings and hiring. September results regarding perceptions of employment conditions by firms and households are also available from recurring surveys, such as the National Federation of Independent Business’s Jobs Report and the Conference Board’s Consumer Confidence Survey."}
{"file": "2025_07_31_Letter.pdf", "para_id": 0, "text": "July Investment Update Prepared by University of Wyoming Foundation Investment Staff 1 Market Commentary: The endowment portfolio gained a new handle this month, crossing over $900 million in assets. Although summer is slipping by rapidly, we have some notable updates on a couple of our investments that I would like to share with you. Leading off, there was great article in the Cowboy State Daily on DISA Technologies. DISA supplies an engineered solution to separate critical minerals from mined ore. The impact of their technology extends all the way from reducing operating costs for mining activities to remediating radioactive mine waste from abandoned uranium mines. This Wyoming based company is a leading participant in the effort to augment the existing state economy by introducing novel technology and AI to capital intensive industries home to this state. The foundation invested just under $1 million in DISA in September 2023 representing 1.18% of the company. Based on their latest VC lead funding round, our position is now $1.7 million. We believe the company is on the front end of significant revenue growth and excitement is growing for their home-grown success. Another endowment investment in the news is the leading global (100+ countries) bitcoin financial services firm Strike. Our investment in Strike results from both a VC fund investment through Ten31 and direct co-investments. Our ownership in Strike is approximately 1.3% of the company. Strike recently launched an innovative lending product for holders of bitcoin. We believe the demand for the product in the near term is measured in billions of dollars and in the longer term, tens of billions of dollars. Strike currently offers loans against bitcoin held at Strike from $10k up to $1 billion dollars. The product is off to an extremely strong start and we estimate they capture over 300 basis points on the loan product. Initial Loan to Value (LTV) is 50% to accommodate price volatility with margin call structures starting at 70% LTV. Our"}
{"file": "2025_07_31_Letter.pdf", "para_id": 1, "text": "July Investment Update Prepared by University of Wyoming Foundation Investment Staff 2 blended cost basis on capital invested in Strike stands at $4.725 million. The company may raise a small bridge round this fall, valuation estimates are around $1.5 billion for Strike or $20 million as applied to our investment. Strike is growing the base business of buying or selling bitcoin at over 100% per annum, while gross margins are more than 84% and estimated 2025 net income not including the lending product is $40 million dollars. We believe Strike could double earnings in the coming year off the lending product alone. Although not an investment, our friend and foundation consultant Mika Malone was recently named to Chief Investment Officer Magazine’s 2025 Knowledge Brokers List – much deserved Mika! Estimated Foundation Pool Statistics at a Glance: • Market Value: $901.7 million • Month-to-date: 0.7% • Quarter-to-date: 0.7% • Year-to-date: 5.7% • Fiscal year-to-date: 0.7% Public Winners/Losers: As of 7/30/2025 Portfolio % MTD YTD 1-Year Public Assets + Bitcoin 41.4% 1.3% 9.6% 21.3% S&P 500 2.6% 9.0% 18.6% MSCI ACWI 4.1% 9.7%% 15.8% Winners Portfolio % MTD YTD 1-Year Bitcoin 5.0% 8.7% 25.3% 81.5% FullerThaler Small-Cap 1.9% 3.9% Losers Portfolio % MTD YTD 1-Year WCM Focused International 3.7% -3.9% 20.6% 16.5% Chickasaw 7.0% -1.0% 2.8% 17.1% Private Market Winners/Losers: Private market returns are limited at this point due to the quarter lag. We will have a table of the winners and losers next month once more managers report their 2nd quarter results. July Investment Update Prepared by University of Wyoming Foundation Investment Staff 3 Estimated Public Manager Performance: Key Manager Meetings: • July 2nd – Due Diligence Call with Potential Portfolio Managers for ThirdPath. • July 10th – Intro Call Regan Capital • July 10th – SS&C Update Call with Accounting • July 10th – Kraken Options Call • July 11th – Charlesbank Update Call • July 14th-17th – Walker & Dunlop Investors Conference • July 14th – Golub update Call • July 15th – Custodia Monthly Board Meeting • July 15th – River Associates Update Call • July 16th – University of Minnesota Intro Call • July 16th – R7 Intro Call • July 17th – Unchained Support Call • July 17th – SS&C Update Call with Accounting • July 22nd – Green Street Demo Call • July 23rd – Gold Block Update Call and Sheridan Sourcing • July 23rd – Rook Intro Call • July 23rd – First Eagle Portfolio and Market Update Presentation As of July 30, 2025 06/30/25 Market Value 07/30/25 Market Value % of Portfolio MTD YTD Trailing 1-Year Total Public Assets ex Delayed Managers $413,604,049 $393,774,550 41.4% 1.32% 9.62% 21.33% Equity 357,376,239 329,018,255 36.4% 0.34% 9.53% 15.16% MSCI ACWI TR (Net) 1.86% 12.10% 18.31% US Equity 247,909,538 220,959,026 24.4% 0.95% 3.99% 10.92% DoubleLine Shiller Enhanced CAPE LLC - Class B a/o 11/1/21 (Doubleline Shiller MF prior)70,401,096 40,804,892 4.5% (0.22%) 6.49% 13.38% S&P 500 Total Return Index 2.62% 8.98% 18.61% Vanguard Institutional Index (S&P 500) 96,808,735 99,336,784 11.0% 2.61% 8.98% S&P 500 Total Return Index 2.62% 8.98% Chickasaw Capital Management, LLC 64,232,305 63,699,823 7.0% (1.03%) 2.83% 17.05% Alerian MLP Index TR 2.73% 9.98% 15.52% FullerThaler Behavioral Small-Cap Growth Fund 16,467,402 17,117,527 1.9% 3.95% Russell 2000 Growth Total Return Index 2.68% Developed Markets Equity 68,245,750 66,773,055 7.4% (2.16%) 2.71% 15.97% First Eagle Global Value 33,828,856 33,728,305 3.7% (0.30%) 14.45% 15.49% MSCI EAFE Net Total Return (0.52%) 18.83% 15.76% WCM Focused International Growth 34,416,894 33,044,750 3.7% (3.99%) 20.63% 16.46% MSCI EAFE Net Total Return (0.52%) 18.83% 15.76% Emerging Markets Equity 41,220,951 41,286,174 4.6% 0.16% 1.64% 37.24% Artisan Developing World 41,220,951 41,286,174 4.6% 0.16% 16.95% 37.24% MSCI Emerging Markets Net Total Return 2.69% 18.37% 19.50% Investment Grade 14,212,760 19,085,968 0.0% 0.05% 0.12% 6.70% Brandywine US Fixed Income - Ten Sleep 10,152,760 0 0.0% (0.58%) 3.23% 6.70% S&P U.S. Treasury Bond Current 10-Year Index (0.74%) 4.23% Janus Henderson AAA CLO ETF 4,060,000 19,085,968 2.1% 0.40% Bitcoin 42,015,050 45,670,328 5.0% 8.70% 25.26% 81.47% July Investment Update Prepared by University of Wyoming Foundation Investment Staff 4 • July 24th – Green Street Portfolio and Asset Valuation Demo • July 25th – Aegis Intro Call • July 25th – Walker & Dunlop Update Call and Sheridan Sourcing • July 28th – ArrowMark Intro Call • July 29th – Rook Sourcing and Execution Call • July 31st – SS&C Update Call with Accounting • July 31st – Brick & Bond Sheridan Sourcing Call Investment Subcommittee Meeting: • The subcommittee approved up to a $5 million preferred equity investment in Encore at Heritage Woods Apartments, a Gold Block Ventures sponsored deal. • The subcommittee approved up to a $400,000 short-term secured loan to Custodia Bank. Historical and Current Pool Flows: As of July 31, 2025, the endowment pool ended the month at $904.5 million, reflecting a $12.2 million increase in market value driven entirely by investment performance. Month Ending Beginning Market Value Transfers in/ out of Pool Appreciation/ Depreciation Ending Market Value Transfer Description 7/31/2023 $794.6 -$6.0 $9.3 $797.9 First Part of Board Approved $20 mm for FAFA transfer 8/31/2023 $797.9 -$14.0 -$10.7 $773.2 Second Part of Board Approved $20 mm for FAFA transfer 9/30/2023 $773.2 $9.2 -$17.2 $765.3 Brandywine short-term proceeds sent to wrong account end of month 10/31/2023 $765.3 -$13.0 -$4.8 $747.5 Brandywine and DIT settlement 11/30/2023 $747.5 $0.0 $21.5 $768.9 12/31/2023 $768.9 $0.0 $22.2 $791.2 1/31/2024 $791.2 $0.0 -$0.5 $790.7 2/29/2024 $790.7 $0.0 $19.7 $810.4 3/31/2024 $810.4 $0.0 $17.1 $827.5 4/30/2024 $827.5 $0.0 -$16.0 $811.4 5/31/2024 $811.4 $0.0 $13.1 $824.5 6/30/2024 $824.5 $0.0 $4.0 $828.5 7/31/2024 $828.5 $0.0 $6.2 $834.7 8/31/2024 $834.7 $0.0 $10.1 $844.8 9/30/2024 $844.8 $3.6 $14.5 $863.0 DIT settlement 10/31/2024 $863.0 $0.0 $0.2 $863.1 11/30/2024 $863.1 $0.0 $20.8 $883.9 12/31/2024 $883.9 -$5.0 -$17.9 $861.0 DIT settlement 1/31/2025 $861.0 $0.0 $10.6 $871.6 2/28/2025 $871.6 $0.0 -$2.8 $868.8 3/31/2025 $868.8 $0.0 -$11.9 $856.9 4/30/2025 $856.9 $0.0 $6.0 $862.9 5/31/2025 $862.9 $0.0 $16.5 $879.5 6/30/2025 $879.5 -$4.5 $17.3 $892.2 DIT settlement 7/31/2025 $892.2 $0.0 $12.2 $904.5 July Investment Update Prepared by University of Wyoming Foundation Investment Staff 5 Pool Cash: Below is the cash balance as far as we have visibility: INVESTMENT DESCRIPTION DATE CASH FLOW CASH BALANCE CASH 7/31/2025 $16,098,322 MCCORMICK & CO-NON VTG SHRS 8/1/2025 $1,000,000 $17,098,322 BLACKSTONE SRT I 8/1/2025 ($797,026) $16,301,296 FISERV INC 8/4/2025 $1,000,000 $17,301,296 FISERV INC 8/4/2025 $1,000,000 $18,301,296 GOLD BLOCK - ANN ARBOR 8/4/2025 ($4,700,000) $13,601,296 EASTMAN CHEMICAL CO 8/11/2025 $1,000,000 $14,601,296 FISERV INC 8/11/2025 $1,000,000 $15,601,296 EASTMAN CHEMICAL CO 8/12/2025 $1,000,000 $16,601,296 July Investment Update Prepared by University of Wyoming Foundation Investment Staff 6 Short-Term Bond Fund: Liquidity Dashboard - Short Term Date 7/31/2025 Jonah Operating $305,498 0.3% 0.00% $0 0.00% 0.1x 0.0 Jonah Bank Savings $507,531 0.6% 1.40% $7,105 1.40% 0.1x 0.0 First Interstate Bank $61,323 0.1% 0.10% $61 0.10% 0.0x 0.0 Total - Banks $874,352 1.0% 0.82% $7,167 0.82% 0.2x 0.0 US Bank MMF - FGZXX $3,973,605 4.4% 4.19% $166,303 4.19% 0.9x 0.0 Altriarch* $11,000,000 12.2% 13.68% $1,504,251 13.50% 2.5x 321.5 Bitcoin** $6,114,273 6.8% 0.00% $0 0.00% 1.4x 0.0 Commercial Paper $39,362,879 43.5% 4.48% $1,764,559 4.48% 9.0x 16.9 JAAA $6,062,040 6.7% 5.28% $320,185 5.28% 1.4x 0.0 Corporate $7,000,720 7.7% 4.82% $337,295 4.82% 1.6x 117.0 Time Deposit $0 0.0% 0.00% $0 0.00% 0.0x 0.0 US Treasury Bill $11,742,085 13.0% 4.33% $508,481 4.34% 2.7x 65.6 Preferreds $4,358,692 4.8% 8.74% $380,928 9.88% 1.0x Short Term Account $89,614,294 99.0% 5.97% $4,982,001 6.00% 20.5x 69.4 Total $90,488,646 100.0% 5.91% $4,989,168 5.95% 20.7x 68.7 *Monthly distribution annualized W/o Altriarch 0.0 **Bitcoin is not included in the yield calculation Short-Term Fund Composition Banks and Short Term-Inflows and Outflows Yield at Cost 12 Mo. Transfer Coverage Avg: $4,373,816 Duration (Days)Cash & Equivalents Balance Weight Market Yield Market Yield x Balance Cash, 4.8% Altriarch, 13.2% Commercial Paper, 47.1% JAAA, 7.3% Corporate, 8.4% US Treasury Bill, 14.1% Preferreds, 5.2% $ MM $2 MM $4 MM $6 MM $8 MM $10 MM $12 MM Jul-23 Aug-23 Sep-23 Oct-23 Nov-23 Dec-23 Jan-24 Feb-24 Mar-24 Apr-24 May-24 Jun-24 Jul-24 Aug-24 Sep-24 Oct-24 Nov-24 Dec-24 Jan-25 Feb-25 Mar-25 Apr-25 May-25 Jun-25 UW TRANSFER - OUTFLOW FACILITY TRANSFERS - OUTFLOW INFLOWS July Investment Update Prepared by University of Wyoming Foundation Investment Staff 7 Private Market Cash Flows: Best, Philip Treick, Chief Investment Officer Joe Briones, Analyst / Portfolio Manager Hazen Dickerson, Analyst / Portfolio Manager Mac Festa, Investment Analyst Levi Johnson, Summer Intern Nolan Nachbar, Summer Intern Capital Calls ($) Distributions ($) Date Amount Manager Date Amount Manager 7/1/25 (149,378)$ Stone Ridge Energy Acquisition Fund II LP 7/2/2025 784,407$ Sterling Group Partners V, L.P. 7/16/25 (250,000)$ Soil Action, Inc. 7/3/2025 675,126$ MDCP Insurance SPV, L.P. 7/17/25 (165,000)$ Flagship Pioneering-Origination Fund VII 7/3/2025 680,059$ Madison Dearborn Capital Partners VII, L.P. 7/21/25 (774,912)$ Halo Direct UWF Holding 7/8/2025 7,838$ EIG Energy Fund XIV, L.P. 7/23/25 (55,961)$ K4 Private Investors 7/8/2025 503,747$ Ridgemont Equity Partners III, L.P. 7/23/25 (17,839)$ MSouth Equity Partners IV, L.P. 7/9/2025 76,470$ EnCap Energy Capital Fund XI, L.P. 7/23/25 (5,482)$ Tailwater Energy Fund IV, L.P. 7/9/2025 518,154$ New Mountain Partners IV, L.P. 7/25/25 (19,000)$ Scale Venture Partners VI, L.P. 7/10/2025 35,433$ Global Infrastructure Partners IV, L.P. 7/25/25 (7,104)$ FS Equity Partners VIII 7/16/2025 7,148$ Green Equity Investors VI, L.P. 7/28/25 (37,917)$ Scale Venture Partners VII, L.P. 7/18/2025 178,937$ WDIP Multi-Res and Industrial Fund (QP), L.P. 7/30/25 (29,965)$ TCI Real Estate Partners Fund IV Limited 7/21/2025 191,598$ Fortress Credit Opportunities Fund IV, L.P. 7/21/2025 351,768$ SK Capital Partners V, L.P. 7/23/2025 26,332$ DRA Growth and Income Fund IX, LLC 7/28/2025 88,603$ MBK Partners Fund IV (1,512,558)$ TOTAL 4,125,620$ TOTAL"}
{"file": "2025_08_31_Letter.pdf", "para_id": 0, "text": "August Investment Update Prepared by University of Wyoming Foundation Investment Staff 1 Market Commentary: I loved the 70’s. I remember my brother coming home from college in 1970 driving a pink Chevy convertible sporting long hair and a Fu Manchu mustache. Music was exploding, albums and anthems like The Rolling Stones - Exile on Mainstreet; Queen – Bohemian Rhapsody; Led Zeppelin – Stairway to Heaven; Pink Floyd – Dark Side of the Moon; Marvin Gaye – What’s going on; Eagles – Hotel California; Willie Nelson – Red Headed Stranger to name just a few were gracing the AM/FM radio airwaves. The movies were just as iconic - The Godfather, Rocky, Star Wars, One Flew Over the Cuckoo’s Nest, Taxi Driver, Close Encounters of the Third Kind. Add in spaghetti westerns like Two Mules for Sister Sarah or gritty crime dramas like The French Connection and Dirty Harry and you have a cultural decade hard to beat. But beneath the music and movies, the U.S. was trying to finance two wars it couldn’t seem to win - Vietnam and the War on Poverty. The French decided to call our bluff, demanding physical gold instead of depreciating U.S. dollars. Nixon responded by “temporarily” closing the gold window in 1971. The dollar became full fiat, and inflation became the nation’s new backdrop. Lapels were wide, pants were bell bottomed, and Wall Street was still composed of mostly small partnerships that traded their own capital. So, you might ask, what does an awesome decade like the 70’s have to do with our monthly investment team update? The simple answer to that question is Fiscal Dominance and it works like this: Persistent deficits lead to rising debt. As borrowing grows, the Treasury leans on the Fed to keep rates low. Bond markets resist, auctions begin to falter, and the Fed is trapped — it cannot raise rates without worsening the deficit. At that point, fiscal needs dominate monetary policy, and Fed independence erodes.” 1970s Stagflation vs. Today’s Fiscal Dominance Risk Category 1970s (Stagflation, Low Debt, Political Pressure and Low Fiscal Dominance Risk) Today (Inflation, High Debt, Political Pressure High Fiscal Dominance Risk) Debt-to-GDP ~30–40% >100% (projected >200% in coming decades) Deficit Drivers Vietnam War, Great Society programs, oil shocks Structural deficits, interest on debt, entitlements, defense, demographics August Investment Update Prepared by University of Wyoming Foundation Investment Staff 2 Inflation Causes Political pressure on Fed, oil shocks, wage-price spirals, fiat mandate Fiscal arithmetic: rising debt service costs, bond market limits, stimulus overhang Fed’s Constraint Political — Nixon pressured Burns to keep rates low Fiscal and political — higher rates balloon deficit, risk of debt spiral, Trump Fed’s Options Could and would eventually tighten (Volcker shock) Limited: must consider ending IOR, raising reserve requirements, inflation taxation Outcome Double-digit inflation, then painful disinflation Risk of sustained stagflation, bank disintermediation, and reduced central bank independence Credibility of Fed Damaged in 1970s, but restored by Volcker in 1980s Threatened structurally — independence undermined by debt math Systemic Risk Manageable debt → system could absorb harsh tightening High debt → harsh tightening itself could trigger fiscal crisis Talking heads say today feels like the 1970s. Inflation, deficits, and political dysfunction echo that era. But the crucial difference is debt: in the ’70s, Volcker could slam the brakes because debt was modest. Today, with debt above 100% of GDP and climbing, a Volcker-style reset isn’t just unlikely - it may be impossible. Mac thinks Taylor Swift’s music will stand the test of time. I’m not so sure. But we both agree on this: unlike the 1970’s, there is no Volcker waiting in the wings to save us, a Volker style reset is politically and mathematically out of reach. Estimated Foundation Pool Statistics at a Glance: • Market Value: $911.2 million • Month-to-date: 0.7% • Quarter-to-date: 1.1% • Year-to-date: 6.9% • Fiscal year-to-date: 1.1% August Investment Update Prepared by University of Wyoming Foundation Investment Staff 3 Public Winners/Losers: As of 8/28/2025 Portfolio % MTD QTD YTD 1-Year Public Assets + Bitcoin 44.4% 1.8% 2.0% 11.7% 19.0% S&P 500 2.7% 5.0% 11.5% 17.8% MSCI ACWI 3.0% 4.4% 14.9% 17.3% Winners Portfolio % MTD QTD YTD 1-Year FullerThaler Small-Cap 2.0% 9.4% 12.1% First Eagle Global Value 3.9% 4.5% 4.1% 19.5% 16.7% Losers Portfolio % MTD QTD YTD 1-Year Bitcoin 4.7% -3.8% 1.6% 17.1% 85.7% Chickasaw 7.0% -0.6% -1.4% 2.4% 17.1% Private Market Winners/Losers: These represent the current winners and losers among the 78% of private managers who have reported to date. As of 6/30/2025 Portfolio Portfolio % QTD Private Market 44.7% 1.1% Private Equity 27.9% 2.3% Private Debt 3.6% 3.5% Real Estate 8.4% 0.7% Benchmarks Benchmark % QTD Total Private Benchmark -2.2% Russell 3000 + 3% 28.0% -4.0% Credit Suisse Leveraged Loans + 2% 5.0% 1.1% NCREIF Fund Index 11.0% 0.8% Winners Portfolio % QTD K4 Private Investors 1.4% 31.1% Ridgemont III 1.0% 7.5% Losers Portfolio % QTD SK Capital V 0.6% -15.1% Stonepeak Infrastructure III 0.5% -6.8% August Investment Update Prepared by University of Wyoming Foundation Investment Staff 4 Estimated Public Manager Performance: Key Manager Meetings: • Aug 7th – Kraken Bitcoin option writing call • Aug 7th – ThirdPath operational due diligence call • Aug 8th – Gene Humphry board walkthrough • Aug 11th – Sage MSR Update Call • Aug 12th – Access Venture LPAC meeting • Aug 13th – Meketa board update call • Aug 14th – CrossingBridge advisors into/due diligence call • Aug 15th – Meketa portfolio builder demo • Aug 15th – GreenStreet call • Aug 18th – 20th – SALT conference • Aug 19th – Clear Investment Group due diligence call • Aug 20th – Zephyr Analytics intro call • Aug 20th – 747 Capital buyout intro call • Aug 22nd – Zephyr Analytics Platform Demo • Aug 22nd – Gemspring buyout intro call • Aug 22nd – Aristotle Pacific intro call • Aug 22nd – LittleJohn & Co intro call • Aug 22nd – Trinity Investors Intro call As of August 28, 2025 07/31/25 Market Value 08/28/25 Market Value % of Portfolio MTD QTD YTD Trailing 1-Year Total Public Assets ex Delayed Managers $422,022,197 $435,245,756 47.8% 1.95% 1.96% 11.68% 19.01% Equity 357,502,672 366,413,777 40.2% 2.77% 2.06% 11.40% 14.33% MSCI ACWI TR (Net) 2.98% 4.37% 14.86% 17.28% US Equity 250,259,124 256,094,231 28.1% 2.65% 3.17% 5.08% 10.58% DoubleLine Shiller Enhanced CAPE LLC - Class B a/o 11/1/21 (Doubleline Shiller MF prior)40,527,995 41,877,776 4.6% 3.33% 2.40% 9.29% 13.11% S&P 500 Total Return Index 2.68% 4.98% 11.49% 17.81% Vanguard Institutional Index (S&P 500) 98,977,828 101,624,889 11.2% 2.67% 4.97% 11.49% S&P 500 Total Return Index 2.68% 4.98% 11.49% Chickasaw Capital Management, LLC 63,822,357 63,449,669 7.0% (0.58%) (1.42%) 2.43% 17.06% Alerian MLP Index TR (0.58%) 2.57% 9.81% 15.46% GQG Partners Global Equity Fund 30,049,497 30,680,536 3.4% 2.10% MSCI ACWI TR (Net) 2.98% FullerThaler Behavioral Small-Cap Growth Fund 16,881,448 18,461,360 2.0% 9.36% 12.11% Russell 2000 Growth Total Return Index 6.83% 8.65% Developed Markets Equity 66,609,605 68,576,811 7.5% 2.95% 0.47% 3.19% 17.23% First Eagle Global Value 33,702,075 35,227,827 3.9% 4.53% 4.14% 19.54% 16.65% MSCI EAFE Net Total Return 4.58% 3.11% 23.16% 14.55% WCM Focused International Growth 32,907,530 33,348,984 3.7% 1.34% (3.29%) 21.51% 17.84% MSCI EAFE Net Total Return 4.58% 3.11% 23.16% 14.55% Emerging Markets Equity 40,633,943 41,742,735 4.6% 2.73% 1.27% 1.76% 30.28% Artisan Developing World 40,633,943 41,742,735 4.6% 2.73% 1.27% 18.24% 30.28% MSCI Emerging Markets Net Total Return 1.51% 3.49% 19.28% 17.36% Investment Grade 19,092,875 25,092,875 2.8% 0.42% 0.85% 3.99% 4.03% Janus Henderson AAA CLO ETF 19,092,875 25,092,875 2.8% 0.42% 0.85% Total Bitcoin 45,426,650 43,739,104 4.8% (3.71%) 1.61% 17.08% 85.70% Bitcoin 44,366,305 42,690,358 4.7% (3.78%) 1.61% 17.08% 85.70% Bitcoin Held for Sale 1,060,345 1,048,746 0.1% (1.09%) August Investment Update Prepared by University of Wyoming Foundation Investment Staff 5 • Aug 25th – New Vista venture capital intro call • Aug 27th – eVestment platform demo • Aug 29th – Blockchain Capital update call Investment Subcommittee Meeting: • None Notable Investment Updates: • ThirdPath: After a long torturous process we were unable to get ThirdPath through due diligence • Prime Movers Lab Fund II: AbbVie announced that it signed a definitive agreement to acquire the bretisilocin program of Gilgamesh Pharmaceuticals Inc., which will return approximately 53% of the fund or ~$5 million • Bitcoin Options: We have begun selling covered call options on bitcoin and have so far generated a yield on the bitcoin held for sale of 2.6% Historical and Current Pool Flows: As of August 31, 2025, the endowment pool ended the month at $911.2 million, reflecting a $6.8 million increase in market value driven entirely by investment performance. Month Ending Beginning Market Value Transfers in/ out of Pool Appreciation/ Depreciation Ending Market Value Transfer Description 7/31/2023 $794.6 -$6.0 $9.3 $797.9 First Part of Board Approved $20 mm for FAFA transfer 8/31/2023 $797.9 -$14.0 -$10.7 $773.2 Second Part of Board Approved $20 mm for FAFA transfer 9/30/2023 $773.2 $9.2 -$17.2 $765.3 Brandywine short-term proceeds sent to wrong account end of month 10/31/2023 $765.3 -$13.0 -$4.8 $747.5 Brandywine and DIT settlement 11/30/2023 $747.5 $0.0 $21.5 $768.9 12/31/2023 $768.9 $0.0 $22.2 $791.2 1/31/2024 $791.2 $0.0 -$0.5 $790.7 2/29/2024 $790.7 $0.0 $19.7 $810.4 3/31/2024 $810.4 $0.0 $17.1 $827.5 4/30/2024 $827.5 $0.0 -$16.0 $811.4 5/31/2024 $811.4 $0.0 $13.1 $824.5 6/30/2024 $824.5 $0.0 $4.0 $828.5 7/31/2024 $828.5 $0.0 $6.2 $834.7 8/31/2024 $834.7 $0.0 $10.1 $844.8 9/30/2024 $844.8 $3.6 $14.5 $863.0 DIT settlement 10/31/2024 $863.0 $0.0 $0.2 $863.1 11/30/2024 $863.1 $0.0 $20.8 $883.9 12/31/2024 $883.9 -$5.0 -$17.9 $861.0 DIT settlement 1/31/2025 $861.0 $0.0 $10.6 $871.6 2/28/2025 $871.6 $0.0 -$2.8 $868.8 3/31/2025 $868.8 $0.0 -$11.9 $856.9 4/30/2025 $856.9 $0.0 $6.0 $862.9 5/31/2025 $862.9 $0.0 $16.5 $879.5 6/30/2025 $879.5 -$4.5 $17.3 $892.2 DIT settlement 7/31/2025 $892.2 $0.0 $12.2 $904.5 8/31/2025 $904.5 $0.0 $6.8 $911.2 August Investment Update Prepared by University of Wyoming Foundation Investment Staff 6 Pool Cash: Below is the cash balance as far as we have visibility: INVESTMENT DESCRIPTION DATE CASH FLOW CASH BALANCE CASH 8/29/2025 $12,236,102 MSTR 9 PERP Pfd 8/29/2025 $2,054,270 $14,290,371 AUTOZONE INC 9/3/2025 $1,200,000 $15,490,371 CAN PACIFIC RAILWAY 9/3/2025 $1,000,000 $16,490,371 O'REILLY AUTOMOTIVE INC 9/3/2025 $1,000,000 $17,490,371 ENCAP ENERGY CAPITAL FUND XI, LP 9/3/2025 ($9,151) $17,481,220 CBRE GROUP INC - A 9/4/2025 $1,000,000 $18,481,220 CENTERPOINT ENERGY INC 9/4/2025 $1,000,000 $19,481,220 PRIME MOVERS GROWTH FUND I 9/5/2025 ($400,000) $19,081,220 O'REILLY AUTOMOTIVE INC 9/5/2025 $250,000 $19,331,220 EASTMAN CHEMICAL CO 9/8/2025 $1,000,000 $20,331,220 ENCAP ENERGY CAPITAL FUND XI, LP 9/11/2025 ($14,100) $20,317,121 MONDELEZ INTERNATIONAL INC-A 9/16/2025 $675,000 $20,992,121 PARKER HANNIFIN CORP 9/16/2025 $1,000,000 $21,992,121 LIBERTY UTILITIES CO 9/18/2025 $1,500,000 $23,492,121 NEXTERA ENERGY INC 10/8/2025 $500,000 $23,992,121 August Investment Update Prepared by University of Wyoming Foundation Investment Staff 7 Short-Term Bond Fund: Liquidity Dashboard - Short Term Date 8/29/2025 Jonah Operating $751,847 0.8% 0.00% $0 0.00% 0.2x 0.0 Jonah Bank Savings $508,394 0.6% 1.40% $7,118 1.40% 0.1x 0.0 First Interstate Bank $9,931 0.0% 0.10% $10 0.10% 0.0x 0.0 Total - Banks $1,270,172 1.4% 0.56% $7,127 0.56% 0.3x 0.0 US Bank MMF - FGZXX $3,234,349 3.5% 4.17% $134,872 4.17% 0.7x 0.0 Altriarch* $11,000,000 12.1% 13.89% $1,527,744 13.50% 2.5x 292.5 Bitcoin** $5,687,862 6.2% 0.00% $0 0.00% 1.3x 0.0 Commercial Paper $39,937,823 43.8% 4.42% $1,766,616 4.42% 9.1x 20.1 JAAA $6,068,607 6.7% 5.09% $308,892 5.09% 1.4x 0.0 Corporate $7,000,000 7.7% 4.82% $337,260 4.82% 1.6x 88.0 Time Deposit $0 0.0% 0.00% $0 0.00% 0.0x 0.0 US Treasury Bill $11,742,085 12.9% 4.33% $508,481 4.34% 2.7x 36.6 Preferreds $5,279,366 5.8% 9.00% $474,933 9.79% 1.2x Short Term Account $89,950,091 98.6% 6.00% $5,058,799 6.00% 20.6x 60.1 Total $91,220,264 100.0% 5.92% $5,065,927 5.93% 20.9x 59.3 *Monthly distribution annualized W/o Altriarch 0.0 **Bitcoin is not included in the yield calculation Short-Term Fund Composition Banks and Short Term-Inflows and Outflows Yield at Cost 12 Mo. Transfer Coverage Avg: $4,373,816 Duration (Days)Cash & Equivalents Balance Weight Market Yield Market Yield x Balance Cash, 3.8% Altriarch, 13.1% Commercial Paper, 47.4%JAAA, 7.2% Corporate, 8.3% US Treasury Bill, 13.9% Preferreds, 6.3% $ MM $2 MM $4 MM $6 MM $8 MM $10 MM $12 MM Aug-23 Sep-23 Oct-23 Nov-23 Dec-23 Jan-24 Feb-24 Mar-24 Apr-24 May-24 Jun-24 Jul-24 Aug-24 Sep-24 Oct-24 Nov-24 Dec-24 Jan-25 Feb-25 Mar-25 Apr-25 May-25 Jun-25 Jul-25 Aug-25 UW TRANSFER - OUTFLOW FACILITY TRANSFERS - OUTFLOW INFLOWS August Investment Update Prepared by University of Wyoming Foundation Investment Staff 8 Private Market Cash Flows: Best, Philip Treick, Chief Investment Officer Joe Briones, Analyst / Portfolio Manager Hazen Dickerson, Analyst / Portfolio Manager Mac Festa, Investment Analyst Levi Johnson, Summer Intern Nolan Nachbar, Summer Intern Capital Calls ($) Distributions ($) Date Amount Manager Date Amount Manager 8/4/25 (4,700,000)$ MANCHESTER SCIO APARTMENTS PREFERRED INVESTORS, LLC 8/1/2025 379,003$ Orion Mine Finance (Delaware) Fund II, LP 8/29/25 (91,000)$ Point 406 Ventures IV, L.P 8/5/2025 74,486$ TCI Real Estate Partners Fund IV Limited 8/7/2025 10,670$ EnCap Energy Capital Fund XI, L.P. 8/7/2025 43,737$ Fortress Credit Opportunities Fund IV, L.P. 8/8/2025 105,079$ HH 170 UW, LLC 8/12/2025 52,426$ Fortress Credit Opportunities Fund III, L.P. 8/13/2025 2,776$ Tailwater Energy Fund III, L.P. 8/13/2025 12,517$ MSouth Equity Partners IV, L.P. 8/14/2025 353,000$ Atlas Venture Fund XII 8/15/2025 41,473$ DRA Growth and Income Fund X, LLC 8/19/2025 337,864$ Atlas Venture Fund XI, L.P. 8/20/2025 19,531$ Stonepeak Infrastructure Fund III, L.P. 8/25/2025 33,880$ Fortress Credit Opportunities Fund, L.P. 8/25/2025 229,416$ K4 Private Investors 8/26/2025 3,216,583$ OAKTREE CLO EQUITY FUND I, L.P. 8/27/2025 23,762$ Fortress Credit Opportunities Fund II, L.P. 8/28/2025 154,587$ Global Infrastructure Partners III, L.P. (4,791,000)$ TOTAL 5,090,789$ TOTAL"}
{"file": "2025_09_30_SEPT_Letter.pdf", "para_id": 0, "text": "September Investment Update Prepared by University of Wyoming Foundation Investment Staff 1 Market Commentary: Energy and Tech, some would say they make for strange bedfellows, yet today they stand as the primary pillars of our public equity portfolio with exposures in the high teens, despite technology representing our largest relative underweight vs the MSCI World and S&P 500 Indices, while Oil & Gas—predominantly in the midstream segment—represents our largest overweight. These two pillars, often perceived as diametrically opposed, are increasingly converging amid shifting economic priorities and geopolitical tensions. Our positioning reflects a strategic allocation based on their resilience and long-term growth prospects despite current headwinds. Leading technology stocks have been the posterchild for businesses considered to possess economic moats, fueled by capital-efficient, software-centric, and subscription-based models that generate predictable cash flows with high margins and strong returns on capital. Yet, this stellar business model is giving way to a new reality of rapidly escalating capital intensity and increasing uncertainty regarding future returns on capital. Microsoft's trailing 12-month CapEx exceeded $64.5 billion as of June 30, more than two and a half times those of ExxonMobil, the standard-bearer among US-based Oil Majors, which spent just over $25 billion despite their nearly $50 billion revenue advantage. The recent CapEx surge on AI infrastructure among the Mag-7 signals a departure from tech's lean archetype, mirroring the capital-intensity often viewed as synonymous with old-economy industries. Conversely, the Oil & Gas sector, long plagued by boom-bust volatility from supply and demand shocks, geopolitical events, and poor capital allocation, is undergoing a renaissance. Publicly traded firms have found religion in the form of capital discipline post the 2014-2016 and 2020 downturns, slashing debt to bolster balance sheets, squeezing out efficiencies through leaner operations, and prioritizing shareholder returns over rampant production growth. This pivot has stabilized cash flows, enabling robust dividends and buybacks. Intriguingly, both sectors (energy and technology) are expected to benefit from several shared secular tailwinds: AI's voracious electricity appetite boosts tech's CapEx cycle while increasing natural gas demand; broader themes like electrification, grid modernization, heightened geopolitical tensions/defense spending, tariffs, and onshoring further amplify their prospects, positioning them at pivotal inflection points. Looking ahead, recent forecasts of a growing oil supply glut—triggered by tariff announcements and the rollback of OPEC+ supply cuts—appear overdone, with global demand proving resilient and WTI Crude finding a floor in the low $60s per barrel. Recession risks loom short-term, but long-term drivers provide strong support for global demand growth. On the supply side, the prolific U.S. production growth of the past decade and a half enabled by the shale revolution is giving way to a narrative of slow and stable growth. With much of the tier-1 drilling acreage largely tapped out and investor demand for capital returns keeping a further lid on growth capital spending, the “drill, baby, drill” days of the past are giving way to the mantra \"$70 is the new $50\" for new well break-evens, sentiments echoed by industry leaders like Diamondback Energy's Travis Stice in a recent investor letter in which he stated that geologic headwinds are beginning to outweigh the tailwinds of technological innovation and operational efficiencies. September Investment Update Prepared by University of Wyoming Foundation Investment Staff 2 Further supporting this narrative is an increasingly widely held view that OPEC+ spare capacity is less than previously thought and concentrated in the hands of a few countries. In this context, we consider our energy allocation via Chickasaw and Stoneridge Energy to offer a compelling investment opportunity characterized by attractive valuations, high dividend yields, and robust earnings growth. These investments are well-suited to capitalize on AI-fueled energy needs and other demand drivers and muted supply expansion while mitigating broader sector risks through their largely fee-based and contractual revenue streams. Estimated Foundation Pool Statistics at a Glance: • Market Value: $911.5 million • Month-to-date: 1.0% • Quarter-to-date: 2.1% • Year-to-date: 7.9% • Fiscal year-to-date: 2.1% Public Winners/Losers: As of 9/29/2025 Portfolio % MTD QTD YTD 1-Year Public Assets + Bitcoin 45.5% 2.3% 3.5% 13.5% 18.2% S&P 500 3.2% 7.7% 14.4% 17.6% MSCI ACWI 3.2% 7.2% 17.9% 16.6% Winners Portfolio % MTD QTD YTD 1-Year Bitcoin 4.9% 4.8% 3.6% 19.4% 75.0% WCM Focused Int’l 3.8% 4.3% 0.9% 26.8% 17.4% Losers Portfolio % MTD QTD YTD 1-Year DoubleLine Enhanced CAPE 4.6% -0.9% 1.8% 8.7% 9.9% GQG Global Equity 3.3% -0.5% September Investment Update Prepared by University of Wyoming Foundation Investment Staff 3 Private Market Winners/Losers: These represent the current winners and losers among the 86% of private managers who have reported to date. As of 6/30/2025 Portfolio Portfolio Weight % QTD Private Market 44.7% 1.1% Private Equity 27.9% 2.3% Private Debt 3.6% 3.5% Real Estate 8.4% 0.7% Benchmarks Benchmark Weight % QTD Total Private Benchmark 44.0% -2.2% Russell 3000 + 3% 28.0% -4.0% Credit Suisse Leveraged Loans + 2% 5.0% 1.1% NCREIF Fund Index 11.0% 0.8% Winners Portfolio Weight % QTD K4 Private Investors 1.4% 12.8% Ridgemont III 1.0% 14.2% Losers Portfolio Weight % QTD SK Capital V 0.6% -15.1% Stonepeak Infrastructure III 0.5% -6.8% September Investment Update Prepared by University of Wyoming Foundation Investment Staff 4 Estimated Public Manager Performance: Key Manager Meetings: • Sept 2nd – Franklin Park intro call • Sept 3rd – Custodia Special Committee meeting • Sept 3rd – Fuller & Thaler strategy update • Sept 3rd – Walker Webcast – habitat for humanity • Sept 5th – Intro call to Donald Smith and Co. • Sept 5th – Green Street introduction call • Sept 10th – Prime Movers Growth Fund update • Sept15th – Clean Spark update call • Sept 16th – Custodia monthly Board Meeting • Sept 18th – eVestment intro call and demo • Sept 19th – Sage Residential introductory call • Sept 22nd – Humla Ventures intro call with Custodia • Sept 24th – Humla Ventures follow up call with Custodia • Sept 24th – Soil Action September Board meeting • Sept 26th – Catchup call with Philip VanGraafeiland, public retirement system New Jersey • Sept 29th – Chorus Capital – European Risk Transfer strategy intro call • Sept 30th – Donald Smith follow up due diligence call As of September 29, 2025 08/31/25 Market Value 09/29/25 Market Value % of Portfolio MTD QTD YTD Trailing 1-Year Total Public Assets ex Delayed Managers $426,984,288 $436,234,746 45.5% 2.26% 3.48% 13.33% 18.22% Equity 365,341,283 372,571,629 38.5% 2.02% 3.56% 13.22% 14.37% MSCI ACWI TR (Net) 3.17% 7.15% 17.92% 16.62% US Equity 255,463,191 259,213,201 26.1% 1.36% 4.30% 5.71% 12.23% DoubleLine Shiller Enhanced CAPE LLC - Class B a/o 11/1/21 (Doubleline Shiller MF prior)41,877,776 41,639,913 4.6% (0.86%) 1.82% 8.67% 9.88% S&P 500 Total Return Index 3.22% 7.67% 14.35% 17.61% Vanguard Institutional Index (S&P 500) 101,624,889 84,060,843 9.2% 3.23% 7.68% 14.36% 17.14% S&P 500 Total Return Index 3.22% 7.67% 14.35% 17.61% VanEck Semiconductor ETF 0 21,190,050 2.3% S&P 500 Total Return Index Chickasaw Capital Management, LLC 63,449,669 63,418,740 7.0% (0.50%) (1.47%) 2.38% 13.49% Alerian MLP Index TR (3.98%) (1.52%) 5.43% 10.64% GQG Partners Global Equity Fund 30,049,497 29,890,235 3.3% (0.53%) MSCI ACWI TR (Net) 3.17% FullerThaler Behavioral Small-Cap Growth Fund 18,461,360 19,013,421 2.1% 4.20% 15.46% Russell 2000 Growth Total Return Index 6.83% 8.65% Developed Markets Equity 68,135,357 71,044,992 7.8% 4.30% 4.79% 3.99% 17.57% First Eagle Global Value 35,227,827 36,718,605 4.0% 4.28% 8.54% 24.60% 17.77% MSCI EAFE Net Total Return 1.23% 4.06% 24.30% 12.48% WCM Focused International Growth 32,907,530 34,326,387 3.8% 4.31% 0.88% 26.75% 17.36% MSCI EAFE Net Total Return 1.23% 4.06% 24.30% 12.48% Emerging Markets Equity 41,742,735 42,313,436 4.6% 1.84% 2.65% 1.92% 20.42% Artisan Developing World 41,742,735 42,313,436 4.6% 1.84% 2.65% 19.86% 20.42% MSCI Emerging Markets Net Total Return 6.64% 10.11% 26.93% 16.40% Investment Grade 19,092,875 19,089,116 2.1% 0.36% 1.26% Janus Henderson AAA CLO ETF 19,092,875 19,089,116 2.1% 0.36% 1.26% Total Bitcoin 42,550,130 44,574,000 4.9% 4.76% 3.61% 19.40% 75.03% Bitcoin 41,556,948 43,533,558 4.8% 4.76% 3.61% 19.40% 75.03% Bitcoin Held for Sale 993,182 1,040,442 0.1% 4.76% September Investment Update Prepared by University of Wyoming Foundation Investment Staff 5 Investment Subcommittee Meeting: • None Historical and Current Pool Flows: As of September 30, 2025, the endowment pool ended the month with a market value of $911.5 million. During the month, $8.8 million was transferred out of the pool for the Athletics Quasi Endowment. The pool still recorded a net increase of $9.1 million from investment performance. Month Ending Beginning Market Value Transfers in/ out of Pool Appreciation/ Depreciation Ending Market Value Transfer Description 7/31/2023 $794.6 -$6.0 $9.3 $797.9 First Part of Board Approved $20 mm for FAFA transfer 8/31/2023 $797.9 -$14.0 -$10.7 $773.2 Second Part of Board Approved $20 mm for FAFA transfer 9/30/2023 $773.2 $9.2 -$17.2 $765.3 Brandywine short-term proceeds sent to wrong account end of month 10/31/2023 $765.3 -$13.0 -$4.8 $747.5 Brandywine and DIT settlement 11/30/2023 $747.5 $0.0 $21.5 $768.9 12/31/2023 $768.9 $0.0 $22.2 $791.2 1/31/2024 $791.2 $0.0 -$0.5 $790.7 2/29/2024 $790.7 $0.0 $19.7 $810.4 3/31/2024 $810.4 $0.0 $17.1 $827.5 4/30/2024 $827.5 $0.0 -$16.0 $811.4 5/31/2024 $811.4 $0.0 $13.1 $824.5 6/30/2024 $824.5 $0.0 $4.0 $828.5 7/31/2024 $828.5 $0.0 $6.2 $834.7 8/31/2024 $834.7 $0.0 $10.1 $844.8 9/30/2024 $844.8 $3.6 $14.5 $863.0 DIT settlement 10/31/2024 $863.0 $0.0 $0.2 $863.1 11/30/2024 $863.1 $0.0 $20.8 $883.9 12/31/2024 $883.9 -$5.0 -$17.9 $861.0 DIT settlement 1/31/2025 $861.0 $0.0 $10.6 $871.6 2/28/2025 $871.6 $0.0 -$2.8 $868.8 3/31/2025 $868.8 $0.0 -$11.9 $856.9 4/30/2025 $856.9 $0.0 $6.0 $862.9 5/31/2025 $862.9 $0.0 $16.5 $879.5 6/30/2025 $879.5 -$4.5 $17.3 $892.2 DIT settlement 7/31/2025 $892.2 $0.0 $12.2 $904.5 8/31/2025 $904.5 $0.0 $6.8 $911.2 9/30/2025 $911.2 -$8.8 $9.1 $911.5 Athletics Quasi Endowment Transfer September Investment Update Prepared by University of Wyoming Foundation Investment Staff 6 Pool Cash: Below is the cash balance as far as we have visibility: INVESTMENT DESCRIPTION DATE CASH FLOW CASH BALANCE CASH 9/30/2025 $8,190,210 MSTR 9 PERP Pfd 9/30/2025 $2,042,903 $10,233,113 BLACK HILLS CORP 10/1/2025 $1,000,000 $11,233,113 BLACKSTONE SRT 10/1/2025 ($1,060,235) $10,172,878 STONE RIDGE ENERGY ACQUISITION FUND II 10/1/2025 ($1,119,260) $9,053,618 ALTRIARCH SPECIALTY FINANCE FUND 10/3/2025 ($4,000,000) $5,053,618 EDISON INTL 10/6/2025 $1,000,000 $6,053,618 PHILIP MORRIS INTERNATIONAL 10/7/2025 $2,000,000 $8,053,618 NEXTERA ENERGY INC 10/8/2025 $500,000 $8,553,618 AMERICAN CRYSTAL SUGAR-PREF 10/14/2025 $100,000 $8,653,618 SPIRE INC 10/23/2025 $2,000,000 $10,653,618 September Investment Update Prepared by University of Wyoming Foundation Investment Staff 7 Short-Term Bond Fund: Liquidity Dashboard - Short Term Date 9/30/2025 Jonah Operating $2,592,839 2.8% 0.00% $0 0.00% 0.6x 0.0 Jonah Bank Savings $509,202 0.6% 1.40% $7,129 1.40% 0.1x 0.0 First Interstate Bank $10,061 0.0% 0.10% $10 0.10% 0.0x 0.0 Total - Banks $3,112,102 3.4% 0.23% $7,139 0.23% 0.7x 0.0 US Bank MMF - FGZXX $7,952,658 8.7% 4.01% $318,727 4.01% 1.8x 0.0 Altriarch* $11,000,000 12.0% 13.12% $1,443,737 13.50% 2.5x 260.5 Bitcoin** $5,687,862 6.2% 0.00% $0 0.00% 1.3x 0.0 Commercial Paper $36,581,589 40.0% 4.22% $1,545,332 4.22% 8.4x 18.5 JAAA $6,066,219 6.6% 5.26% $319,083 5.26% 1.4x 0.0 Corporate $7,000,000 7.7% 4.82% $337,260 4.82% 1.6x 56.0 US Treasury Bill $8,863,413 9.7% 4.19% $371,282 4.32% 2.0x 58.3 Preferreds $5,141,565 5.6% 10.28% $528,750 10.57% 1.2x Short Term Account $88,293,305 96.6% 5.89% $4,864,171 5.97% 20.2x 53.9 Total $91,405,408 100.0% 5.68% $4,871,310 5.78% 20.9x 52.1 *Monthly distribution annualized W/o Altriarch 0.0 **Bitcoin is not included in the yield calculation Short-Term Fund Composition Banks and Short Term-Inflows and Outflows Yield at Cost 12 Mo. Transfer Coverage Avg: $4,373,816 Duration (Days)Cash & Equivalents Balance Weight Market Yield Market Yield x Balance Cash, 9.6% Altriarch, 13.3% Commercial Paper, 44.3% JAAA, 7.3% Corporate, 8.5% US Treasury Bill, 10.7% Preferreds, 6.2% $ MM $2 MM $4 MM $6 MM $8 MM $10 MM $12 MM Aug-23 Sep-23 Oct-23 Nov-23 Dec-23 Jan-24 Feb-24 Mar-24 Apr-24 May-24 Jun-24 Jul-24 Aug-24 Sep-24 Oct-24 Nov-24 Dec-24 Jan-25 Feb-25 Mar-25 Apr-25 May-25 Jun-25 Jul-25 Aug-25 Sep-25 UW TRANSFER - OUTFLOW FACILITY TRANSFERS - OUTFLOW INFLOWS September Investment Update Prepared by University of Wyoming Foundation Investment Staff 8 Private Market Cash Flows: Best, Philip Treick, Chief Investment Officer Joe Briones, Analyst / Portfolio Manager Hazen Dickerson, Analyst / Portfolio Manager Mac Festa, Investment Analyst Levi Johnson, Summer Intern Nolan Nachbar, Summer Intern Capital Calls ($) Distributions ($) Date Amount Manager Date Amount Manager 9/5/25 (400,000)$ Prime Movers Growth Fund I 9/3/2025 21,939$ EnCap Energy Capital Fund XI, L.P. 9/22/25 (82,263)$ River VIII, L.P. 9/4/2025 43,738$ Fortress Credit Opportunities Fund IV, L.P. 9/23/25 (200,000)$ Access Venture Partners V, L.P. 9/5/2025 354,040$ Atlas Venture Opportunity Fund I 9/23/25 (172,487)$ August Equity Partners V-A. L.P. 9/11/2025 15,286$ Veritas Capital Fund VI, L.P., The 9/23/25 (17,930)$ Stonepeak Infrastructure Fund III, L.P. 9/15/2025 127,327$ BCP Fund II 9/25/25 (11,665)$ TCI Real Estate Partners Fund IV Limited 9/16/2025 162,946$ Rockpoint Real Estate Fund VI, L.P. 9/29/25 (375,000)$ GEM Realty Fund VII 9/19/2025 100,401$ Green Equity Investors VI, L.P. 9/30/25 (76,549)$ Atlas Capital Investors V, L.P. 9/24/2025 26,938$ Glenfield Blaine Investors LLC 9/24/2025 58,275$ Thrive Creekside Townhomes LLC 9/24/2025 247,576$ Global Infrastructure Partners III, L.P. 9/24/2025 281,687$ Exeter Industrial Value Fund V 9/25/2025 279,088$ K4 Private Investors 9/26/2025 20,498$ 3400 E Walnut Industrial Investor LCC 9/26/2025 177,754$ Orion Mine Finance (Delaware) Fund II, LP 9/29/2025 44,437$ Vitruvian Investment Partnership III, L.P. 9/30/2025 28,236$ DRA Growth and Income Fund IX, LLC 9/30/2025 245,224$ Vitruvian Investment Partners I CF (Rollover), L.P. (1,335,894)$ TOTAL 2,235,389$ TOTAL"}
{"file": "2025_10_31_OCT_Letter.pdf", "para_id": 0, "text": "October Investment Update Prepared by University of Wyoming Foundation Investment Staff 1 Market Commentary: Private credit has dominated headlines this month, not for record returns, but for the growing list of lenders discovering yield and risk were never properly aligned and fraud is often behind the curtain waiting to be exposed. The collapse of First Brands Group, Tricolor Holdings, PrimaLend, and several telecom affiliates revealed what happens when capital chases return under the assumption that trust can be used in lieu of appropriate credit structure. Billions of dollars in receivables, once treated as assets, were shown to be duplicated, misrepresented, or unverifiable. For many investors, yield proved to be an illusion sustained only by complacency. The underlying problem is not new, and every credit cycle exhibits it. When liquidity is abundant and competition for deployment intensifies, risk tolerance drifts higher and verification gravitates lower. Ultimately, covenants weaken, intercreditor agreements disappear, and due diligence becomes a checklist rather than a process. The result is not an immediate crisis but a slow erosion of underwriting discipline that only becomes visible when cash flows tighten and collateral proves fugazi. This phase of the cycle always feels calm before it feels costly. Underwriting disasters tied to First Brands et al., highlight and contrast the approach taken by one of our credit managers, Altriarch. As the disasters unfolded, Altriarch proactively communicated what was happening, which was helpful in alleviating any concerns they might have exposure to fraud. Their underwriting philosophy begins with verified collateral, not modeled assumptions. Each credit facility they extend is supported by direct verification of receivables, filed UCC liens, and intercreditor clarity that defines who owns what and when. They require DACAs (Deposit Account Control Agreements) to ensure that payments flow directly to secured accounts and that borrower transparency remains constant throughout the life of the loan. In their view, return is earned through precision, not optimism. It is shocking how poor the industry underwriting became on First Brands et al. That discipline has occasionally cost Altriarch opportunities. Over the past year, they have passed on more than $100 million in potential loans where yield targets looked attractive but the underlying documentation failed basic verification tests; this included First Brands. Their patience appears well-placed. Many borrowers are showing signs of stress or are seeking restructurings under new, looser lenders. For Altriarch—and by extension, for us—the absence of activity is not inactivity; it is protection. Across the broader market, competing capital continues to compress spreads and extend risk even as the cycle matures. Some large lenders, like affiliates of Apollo Global Management, are purportedly offering factor facilities at 8.5% where according to Alriarch, the risk more appropriately prices at 15-16%. The appeal is easy to understand. Steady income and optics are attractive, but the tradeoff is structural weakness that cannot be remedied once it is discovered. The pattern mirrors the later stages of every credit cycle: too much capital, too few quality borrowers, and a collective belief that this time, the underwriting shortcuts are different. We are obviously supportive that Altriarch remains intentionally patient, waiting for better pricing and improved terms. The repricing of risk is already underway, but it will not happen in a October Investment Update Prepared by University of Wyoming Foundation Investment Staff 2 single quarter; it will unfold gradually as weaker structures fail. Those with cash, clarity, and covenant discipline will have the opportunity to lend on stronger footing. In an environment where yield can be manufactured but collateral cannot, we want exposure to managers whose first question is not what is the return? but how do we know it is real? Last but not least, Custodia received a long overdue decision on our case at the 10th Circuit Court of Appeals. The court found that the Federal Reserve was within its right to deny Custodia’s master account application on a 2-1 ruling. Custodia has been in prior communication with the Fed with further details to be decided upon. Stay tuned. Estimated Foundation Pool Statistics at a Glance: • Market Value: $914.0 million • Month-to-date: 0.0% • Year-to-date: 8.2% • Fiscal year-to-date: 2.4% • Total Funds value (pool + short term fund) $1.003 Billion Public Winners/Losers: As of 10/30/2025 Portfolio % MTD YTD 1-Year Public Assets + Bitcoin 44.6% -0.5% 17.2% 20.6% S&P 500 2.1% 17.2% 18.9% MSCI ACWI 2.1% 21.0% 20.7% Winners Portfolio % MTD YTD 1-Year VanEck Semiconductor ETF 2.6% 11.5% FullerThaler Small-cap Growth 2.2% 3.8% Losers Portfolio % MTD YTD 1-Year Bitcoin 4.6% -6.2% 15.0% 50.1% Chickasaw 6.6% -4.9% -2.9% 4.5% Estimated Returns Private Market Winners/Losers: Private market returns are limited at this point due to the quarter lag. We will have a table of the winners and losers next month when more managers have report their 3rd quarter results. October Investment Update Prepared by University of Wyoming Foundation Investment Staff 3 Estimated Public Manager Performance: Key Manager Meetings: • Oct 1st – ABS Global Investments intro call • Oct 2nd – Rithm intro call • Oct 2nd – Prometheus Hyperscale intro call • Oct 3rd – Hartford Funds intro call • Oct 3rd – Alidade Capital intro call • Oct 3rd – Custodia Bank Special committee call • Oct 6th – Walker & Dunlop catch up call • Oct 7th – Armin Ellis catch up call • Oct 8th – Prime Movers Lab catch up call • Oct 9th – Scale Ventures annual meeting • Oct 14th – Altriarch catch up call • Oct 15th-18th – Philip in Boston for First Robotics conference • Oct 15th – Geoff Smith, Walker & Dunlop debt fund update • Oct 16th – Philip and Jeremy Forster meeting • Oct 16th – Altriarch investor update on First Brands • Oct 16th – Eventide Q4 update call • Oct 16th – Joe in Jackson Hole for Global Tech Summit As of October 30, 2025 09/30/25 Market Value 10/30/25 Market Value % of Portfolio MTD YTD Trailing 1-Year Total Public Assets ex Delayed Managers $436,112,488 $431,576,307 44.6% (0.53%) 17.20% 20.63% Equity 372,316,585 370,587,431 37.9% 0.27% 15.71% 16.58% MSCI ACWI TR (Net) 2.13% 20.96% 20.68% US Equity 259,939,141 258,428,009 25.7% 0.49% 5.51% 11.44% Vanguard Institutional Index (S&P 500) 84,060,843 124,629,396 13.6% 2.06% 17.21% 18.87% S&P 500 Total Return Index 2.07% 17.20% 18.88% VanEck Semiconductor ETF 21,190,050 23,887,240 2.6% 11.45% S&P 500 Total Return Index 2.07% Chickasaw Capital Management, LLC 63,418,740 60,306,556 6.6% (4.85%) (2.85%) 4.51% Alerian MLP Index TR (1.19%) 4.49% 11.14% GQG Partners Global Equity Fund 30,616,175 29,676,136 3.2% (3.07%) MSCI ACWI TR (Net) 2.13% FullerThaler Behavioral Small-Cap Growth Fund 19,013,421 19,928,680 2.2% 3.82% Russell 2000 Growth Total Return Index 2.32% Developed Markets Equity 70,064,008 70,123,184 7.7% (0.14%) 4.00% 20.43% First Eagle Global Value 36,718,605 37,116,437 4.1% 0.66% 25.95% 20.31% MSCI EAFE Net Total Return 1.38% 26.87% 22.20% WCM Focused International Growth 33,345,403 33,006,747 3.6% (1.02%) 25.41% 20.57% MSCI EAFE Net Total Return 1.38% 26.87% 22.20% Emerging Markets Equity 42,313,436 42,036,238 4.6% (0.15%) 1.84% 18.15% Artisan Developing World 42,313,436 42,036,238 4.6% (0.15%) 19.08% 18.15% MSCI Emerging Markets Net Total Return 4.93% 33.82% 28.05% Investment Grade 19,089,116 19,059,043 2.1% 0.29% Janus Henderson AAA CLO ETF 19,089,116 19,059,043 2.1% 0.29% Total Bitcoin 44,706,787 41,929,833 4.6% (6.21%) 14.95% 50.10% Bitcoin 43,663,266 40,932,891 4.5% (6.25%) 14.95% 50.10% Bitcoin Held for Sale 1,043,521 996,942 0.1% (4.46%) October Investment Update Prepared by University of Wyoming Foundation Investment Staff 4 • Oct 21st – Investments discussion with Lindsay and John Stark • Oct 21st – R7 Spotlight call • Oct 21st – Custodia board meeting • Oct 21st – Altriarch Advisory committee annual meeting • Oct 22nd – Baron Discovery Strategy intro call • Oct 22nd – Regan Capital update call • Oct 23rd – First Eagle portfolio and market update call • Oct 23rd – Gold Block Venture update call • Oct 23rd – Crossing Bridge quarterly call • Oct 23rd – Artisan Partners Developing World fund update call • Oct 24th – Clear Investment Group Fund II call • Oct 27th – Investment Committee meeting • Oct 28th – Dorman Products quarterly earnings call • Oct 29th – Access Ventures annual meeting • Oct 30th – Custodia Bank update call • Oct 30th – Kopernik Global Investors quarterly conference call • Oct 30th – Strategy quarterly earnings call • Oct 30th – Mac in Kansas City for Gold Block Ventures due diligence Intra-month Investment Committee Meeting: • The investment committee approved up to a $10 million investment in Clear Investment Group’s Clear Opportunities Fund II, subject to final legal due diligence. Fee break, 12% preferred return hurdle and LPAC included. October Investment Update Prepared by University of Wyoming Foundation Investment Staff 5 Historical and Current Pool Flows: As of October 31, 2025, the endowment pool’s market value stood at $914.0 million. There were no transfers during the month. The portfolio’s value increased by $2.5 million, reflecting updated private market valuations for Q2 rather than performance gains. Month Ending Beginning Market Value Transfers in/ out of Pool Appreciation/ Depreciation Ending Market Value Transfer Description 7/31/2023 $794.6 -$6.0 $9.3 $797.9 First Part of Board Approved $20 mm for FAFA transfer 8/31/2023 $797.9 -$14.0 -$10.7 $773.2 Second Part of Board Approved $20 mm for FAFA transfer 9/30/2023 $773.2 $9.2 -$17.2 $765.3 Brandywine short-term proceeds sent to wrong account end of month 10/31/2023 $765.3 -$13.0 -$4.8 $747.5 Brandywine and DIT settlement 11/30/2023 $747.5 $0.0 $21.5 $768.9 12/31/2023 $768.9 $0.0 $22.2 $791.2 1/31/2024 $791.2 $0.0 -$0.5 $790.7 2/29/2024 $790.7 $0.0 $19.7 $810.4 3/31/2024 $810.4 $0.0 $17.1 $827.5 4/30/2024 $827.5 $0.0 -$16.0 $811.4 5/31/2024 $811.4 $0.0 $13.1 $824.5 6/30/2024 $824.5 $0.0 $4.0 $828.5 7/31/2024 $828.5 $0.0 $6.2 $834.7 8/31/2024 $834.7 $0.0 $10.1 $844.8 9/30/2024 $844.8 $3.6 $14.5 $863.0 DIT settlement 10/31/2024 $863.0 $0.0 $0.2 $863.1 11/30/2024 $863.1 $0.0 $20.8 $883.9 12/31/2024 $883.9 -$5.0 -$17.9 $861.0 DIT settlement 1/31/2025 $861.0 $0.0 $10.6 $871.6 2/28/2025 $871.6 $0.0 -$2.8 $868.8 3/31/2025 $868.8 $0.0 -$11.9 $856.9 4/30/2025 $856.9 $0.0 $6.0 $862.9 5/31/2025 $862.9 $0.0 $16.5 $879.5 6/30/2025 $879.5 -$4.5 $17.3 $892.2 DIT settlement 7/31/2025 $892.2 $0.0 $12.2 $904.5 8/31/2025 $904.5 $0.0 $6.8 $911.2 9/30/2025 $911.2 -$8.8 $9.1 $911.5 Athletics Quasi Endowment Transfer 10/31/2025 $911.5 $0.0 $2.5 $914.0 October Investment Update Prepared by University of Wyoming Foundation Investment Staff 6 Pool Cash: Below is the cash balance as far as we have visibility: INVESTMENT DESCRIPTION DATE CASH FLOW CASH BALANCE CASH 10/31/2025 $6,004,274 STRC 10/31/2025 $2,091,318 $8,095,592 AMETEK INC 11/3/2025 $1,000,000 $9,095,592 CARRIER GLOBAL CORP 11/3/2025 $2,000,000 $11,095,592 GENUINE PARTS CO 11/4/2025 $1,000,000 $12,095,592 PARKER HANNIFIN CORP 11/4/2025 $250,000 $12,345,592 PARKER HANNIFIN CORP 11/4/2025 $1,000,000 $13,345,592 LIBERTY UTILITIES CO 11/4/2025 $500,000 $13,845,592 ACCESS VENTURE PARTNERS V, LP. 11/4/2025 ($312,500) $13,533,092 ALIMENTATION COUCHE-TARD INC 11/7/2025 $1,000,000 $14,533,092 PLAINS ALL AMER PIPELINE LP 11/7/2025 $1,000,000 $15,533,092 PARKER HANNIFIN CORP 11/7/2025 $1,000,000 $16,533,092 MCCORMICK & CO-NON VTG SHRS 11/10/2025 $1,000,000 $17,533,092 EVERGY MISSOURI WEST 11/12/2025 $1,000,000 $18,533,092 ANALOG DEVICES INC 11/13/2025 $1,500,000 $20,033,092 PLAINS ALL AMER PIPELINE LP 11/14/2025 $2,000,000 $22,033,092 CANADIAN NATL RAILWAY CO 11/14/2025 $1,000,000 $23,033,092 ALIMENTATION COUCHE-TARD INC 11/18/2025 $1,000,000 $24,033,092 PARKER HANNIFIN CORP 11/19/2025 $1,000,000 $25,033,092 CANADIAN NATL RAILWAY CO 11/20/2025 $1,400,000 $26,433,092 CBRE GROUP INC - A 11/24/2025 $1,000,000 $27,433,092 October Investment Update Prepared by University of Wyoming Foundation Investment Staff 7 Short-Term Bond Fund: Liquidity Dashboard - Short Term Date 10/31/2025 Jonah Operating $426,886 0.5% 0.00% $0 0.00% 0.1x 0.0 Jonah Bank Savings $500,000 0.6% 1.40% $7,000 1.40% 0.1x 0.0 First Interstate Bank $10,267 0.0% 0.10% $10 0.10% 0.0x 0.0 Total - Banks $937,153 1.1% 0.75% $7,010 0.75% 0.2x 0.0 US Bank MMF - FGZXX $346,448 0.4% 4.02% $13,935 4.02% 0.1x 0.0 Altriarch* $11,000,000 12.4% 13.12% $1,443,737 13.50% 2.5x 229.5 Bitcoin** $5,734,053 6.5% 0.00% $0 0.00% 1.3x 0.0 Commercial Paper $43,604,270 49.1% 4.08% $1,777,998 4.08% 10.0x 27.2 JAAA $6,057,860 6.8% 5.36% $324,701 5.36% 1.4x 0.0 Corporate $6,000,000 6.8% 4.82% $288,960 4.82% 1.4x 24.0 US Treasury Bill $9,855,045 11.1% 3.97% $391,300 3.97% 2.3x 69.4 Preferreds $5,250,223 5.9% 10.07% $528,750 10.57% 1.2x Short Term Account $87,847,899 98.9% 5.81% $4,769,381 5.89% 20.1x 55.3 Total $88,785,053 100.0% 5.75% $4,776,392 5.84% 20.3x 54.7 *Monthly distribution annualized W/o Altriarch 0.0 **Bitcoin is not included in the yield calculation Short-Term Fund Composition Banks and Short Term-Inflows and Outflows Yield at Cost 12 Mo. Transfer Coverage Avg: $4,373,816 Duration (Days)Cash & Equivalents Balance Weight Market Yield Market Yield x Balance Cash, 0.4% Altriarch, 13.4% Commercial Paper, 53.1% JAAA, 7.4% Corporate, 7.3% US Treasury Bill, 12.0% Preferreds, 6.4% $ MM $2 MM $4 MM $6 MM $8 MM $10 MM $12 MM Aug-23 Sep-23 Oct-23 Nov-23 Dec-23 Jan-24 Feb-24 Mar-24 Apr-24 May-24 Jun-24 Jul-24 Aug-24 Sep-24 Oct-24 Nov-24 Dec-24 Jan-25 Feb-25 Mar-25 Apr-25 May-25 Jun-25 Jul-25 Aug-25 Sep-25 Oct-25 UW TRANSFER - OUTFLOW FACILITY TRANSFERS - OUTFLOW INFLOWS October Investment Update Prepared by University of Wyoming Foundation Investment Staff 8 Private Market Cash Flows: Best, Philip Treick, Chief Investment Officer Joe Briones, Analyst / Portfolio Manager Hazen Dickerson, Analyst / Portfolio Manager Mac Festa, Investment Analyst Levi Johnson, Summer Intern Nolan Nachbar, Summer Intern Capital Calls ($) Distributions ($) Date Amount Manager Date Amount Manager 10/1/25 (1,119,260)$ Stone Ridge Energy Acquisition Fund II LP 10/2/2025 59,062$ Fortress Credit Opportunities Fund IV, L.P. 10/9/25 (9,890)$ EnCap Energy Capital Fund XI, L.P. 10/9/2025 34,145$ Yorktown Energy Partners VIII, L.P. 10/14/25 (258)$ CITIC Capital China Partners III, L.P. 10/9/2025 775,713$ Green Equity Investors VI, L.P. 10/17/25 (17,078)$ SK Capital Partners V, L.P. 10/10/2025 1,431,473$ Tailwater Energy Fund IV, L.P. 10/20/25 (668,190)$ OAKTREE CLO EQUITY FUND I, L.P. 10/16/2025 207,356$ MSouth Equity Partners IV, L.P. 10/20/25 (198,000)$ Flagship Pioneering-Origination Fund VII 10/17/2025 364$ MDCP Insurance SPV, L.P. 10/20/25 (70,000)$ Flagship Pioneering Special Opportunities Fund II10/17/2025 2,467$ Madison Dearborn Capital Partners VII, L.P. 10/21/25 (44,799)$ Rockpoint Real Estate Fund VI, L.P. 10/17/2025 3,375$ Charlesbank Equity Fund IX 10/30/25 (12,622)$ FS Equity Partners VIII 10/17/2025 101,472$ Stonepeak Infrastructure Fund III, L.P. 10/17/2025 327,508$ Clayton, Dubilier & Rice Fund XII, L.P. 10/20/2025 100,194$ Emberwood Apartments 10/21/2025 424,231$ WDIP Multi-Res and Industrial Fund (QP), L.P. 10/22/2025 69,551$ TCI Real Estate Partners Fund IV Limited 10/27/2025 26,270$ Sterling Group Partners V, L.P. 10/28/2025 104,679$ HH 170 UW, LLC 10/29/2025 22,535$ Fortress Credit Opportunities Fund III, L.P. 10/30/2025 112,320$ Atlas Venture Fund XI, L.P. 10/30/2025 5,190,252$ Prime Movers Lab Fund II, L.P. (2,140,097)$ TOTAL 8,992,967$ TOTAL"}
{"file": "2025_11_30_NOV_Letter.pdf", "para_id": 0, "text": "November Investment Update Prepared by University of Wyoming Foundation Investment Staff 1 Market Commentary: Calendar year 2025 is quickly winding down. During November, the S&P 500 was up the sum of 30 basis points in total return, which sounds boring, until you realize the last five days of the month saved it from being down 4.3%. Private equity fund flows (capital calls vs distributions) were positive at $450k. Year-to-date distributions are outstripping capital calls by a little over $23 million. Public equity managers were up 60 basis points, while fixed income managers returned 40 basis points. Strength in our energy midstream investments were offset by weakness in bitcoin. We included a memo from Howard Marks in last month’s update that framed the difference between ability and willingness to bear risk. In the memo, Marks described a portfolio in quadrant form. Risk is defined or measured as the probability of incurring a permanent capital loss. What drives Ability is a combination of fund flows and growth in liquid assets. Willingness is more of a psychological framework. We collectively may have the ability to tolerate higher risk but might also constrain that ability with protective or defensive mindsets. Our mission to not only grow the payout to the University but also protect its purchasing power requires a thoughtful balance between the two. Our next letter will be the January update, which incorporates December. Wishing everyone happy holidays and a safe new year. Estimated Foundation Pool Statistics at a Glance: • Market Value: $918.9 million • Month-to-date: -0.5% • Year-to-date: 8.3% • Fiscal year-to-date: 2.4% Public Winners/Losers: As of 11/28/2025 Portfolio % MTD YTD 1-Year Public Equity 40.7% 0.6% 15.8% 10.0% S&P 500 0.3% 17.8% 15.0% MSCI ACWI -0.0% 21.1% 18.2% Winners Portfolio % MTD YTD 1-Year Chickasaw 7.0% 6.9% 3.6% -4.7% GQG Partners Global Equity 3.2% 4.3% Losers Portfolio % MTD YTD 1-Year Bitcoin 3.9% -16.6% -2.4% 5.9% Artisan Developing World 4.3% -5.7% -11.8% 8.1%"}
{"file": "2025_11_30_NOV_Letter.pdf", "para_id": 1, "text": "November Investment Update Prepared by University of Wyoming Foundation Investment Staff 2 Estimated Returns Private Market Winners/Losers: These represent the current winners and losers among the ~70% of private managers who have reported to date. As of 9/30/2025 Portfolio Portfolio Weight % QTD Private Market 43.6% 1.3% Private Equity 27.0% 1.2% Private Debt 3.7% 1.6% Real Estate 8.2% 0.1% Benchmarks Benchmark Weight % QTD Total Private Benchmark 44.0% 6.1% Russell 3000 + 3% 28.0% 9.0% Credit Suisse Leveraged Loans + 2% 5.0% 2.2% NCREIF Fund Index 11.0% 0.7% Winners Portfolio Weight % QTD Stonepeak Infrastructure Fund III LP 0.6% 17.5% Clayton, Dubilier XII 0.6% 14.3% Losers Portfolio Weight % QTD Actis Emerging Markets 4 0.2% -31.1% Veritas VI 0.4% -10.1% November Investment Update Prepared by University of Wyoming Foundation Investment Staff 3 Estimated Public Manager Performance: Key Manager Meetings: • Nov 3rd – Reference call for Clear Investment Group • Nov 3rd – Clear Opportunities Fund II review call • Nov 6th – Stone Ridge onsite due diligence mtg • Nov 6th – Sentinel onsite due diligence mtg • Nov 6th – Blackstone onside due diligence mtg • Nov 6th – CD&R onsite due diligence mtg • Nov 6th – Altaris onside due diligence mtg • Nov 7th – Donald Smith onsite due diligence mtg • Nov 7th – First Eagle onsite due diligence mtg • Nov 7th – Alliance Bernstein onsite due diligence mtg • Nov 12 – FullerThaler in-person update mtg • Nov 13th – Gold Block update call • Nov 14th – Matisse Funds intro/due diligence call • Nov 19th – Altriarch: Alleviate Investment opportunity due diligence call • Nov 21 – Altriarch: Alleviate Investment opportunity follow-up call • Nov 25th – Active Vigilance update call • Nov 25th – Stone Ridge/Flywheel operational due diligence call • Nov 26th – Sage due diligence call As of November 28, 2025 !\"#$%FG()%*+F,$-$.I01FI2F3I%$4I5F,$-$.I01,$06I#F7$%(I8I*.9#,\"-#9F!\"F 3$#IF:I#(0- ;($0#I0F!\"F 3$#IF:I#(0- <$%I-5$0F=I$0F !\"F3$#IF :I#(0- !0$*%*-.FL-IF =I$0F:I#(0- G()%*+F?@(*#4 ABCMAEFMAGHIGECJIBO JILMO HIJCO HFIBLOHJIJMO !\"#$%&#'$%()%*+,-. I0102341453 421063271423 N%\")$%F?@(*#4 MGMLMJMHGEIJJAIMO CIACO JILCO !\"!#$%FG()F*#!+H-%+#.I01G2#30(4 5678597J6;<99=<5L ?<=?L 9<8?L !\"#$%&#'$%()%*+,-. I0102341453 OIPIFQ$0.IF<$RF?@(*#4 HCEMCJMMCEHICJHLIMO SJIMBO AILHO HEIJBOHAIMEO VanEck Semiconductor ETF 5=7J=@75;?<??5<@L A5<68L B<6?L C%(M0%F4#E(*G1G0G1H(%+#E(4)F#GHI$#@99JJ5@758B7J68<68J=<8L 9<5?L 5<@6L \"89%:00%(;-<=%),-L?@%$@A,B 014:3 41:C3 2617232:1003 ,*51#0I$T LCMAJAMLJHIFBBIJO LIEEO HICLO AIFGO SCILBO Ch i ck a s a w Ca p i ta l M a n a g em en t, LLC8?7=9=789J<@BB<9L 8<;;L J<?8L =<@6L A?<8BL &=,?M<@%!N9%$@A,B%() F1443 :1:03 221:63 51::3 OIPIFPT$%%F<$RF?@(*#4 MJMHFJMMAJIGMMIMO SJIJMO CIGEO HFILAO 30++)FOL%+)F#M)L%N1HF%+#HO%++AP%Q#!FHRGL#30(4597J@975=9<655<5L A9<95L ?<6;L J9<65L )LGG,==%4000%(;-<=%),-L?@%$@A,B 01CF3 416C3 251H63 H10C3 3IUI%\"RI5FV\"0I*.-F?@(*#4 BMMCCEMGFHIHEBIGO HIALO JIGBO MBIAGOMHIJAO 31F*G#.%M+)#!+H-%+#C%+0) =;79@87=B9<?J?<JL 5<8=L =<5JL 56<J?L 5=<;BL SPT#3HU0*)4#E(G)F(%G1H(%+#!FHRGL =?7=657@;9<BB=<BL A?<99L AJ<?JL 5@<@5L J;<9=L !\"#$%&#'$%()%*+,-. I0102341453 421063271423 ?TI0.*-.F,$06I#1F?@(*#4 AGMCFGMGMEIGHCIAO SFIBAOSLIMBO HHIBEO EIHAO VFG1*%(#P)N)+HQ1(M#SHF+4 =67?@6765;<6J?<=L A@<B=L A8<5BL JJ<B;L ;<J=L !\"#$%IJ,?KM@K%!<?L,-G%+,-%(;-<=%),-L?@ I415C321FC3 4C1FC34C1:23 P-UI1#TI-#FN0$5IFV*2I5FP-+\"TI HGMCFGMLJCIBCMIHO JICMO JIBGO FIMFO X%(0*#Q)(4)F*H(#VVV#PZ[#.O3 J67???7=@5<?=5<JL 9<?5L 9<B6L =<59L X*#+\"*- AFMFECMEBMIMMAIGO SHLIFBOSMJIAFOSMIACO SFIEAO M1GUH1(#Q)+4#\\HF#H%+) ;=9785=<559<JL -15.72%AJ;<98L-19.36% ]S3#M1GUH1(#%UUH0(GA]S3 =?7B@?75?6<99=<;L -16.59%A59<?9L-2.40% -5.89% November Investment Update Prepared by University of Wyoming Foundation Investment Staff 4 Investment Subcommittee Meeting: • Nov 25th – The subcommittee approved an $8 million investment in Stone Ridge Fund III. Historical and Current Pool Flows: As of November 30th, 2025, the endowment pool’s market value stood at $918.9 million. The change in value is attributed to the transfer of Alumni funds to the pool. Month Ending Beginning Market Value Transfers in/ out of Pool Appreciation/ Depreciation Ending Market Value Transfer Description 7/31/2023$794.6 -$6.0 $9.3 $797.9 First Part of Board Approved $20 mm for FAFA transfer 8/31/2023$797.9 -$14.0 -$10.7 $773.2 Second Part of Board Approved $20 mm for FAFA transfer 9/30/2023$773.2 $9.2 -$17.2 $765.3Brandywine short-term proceeds sent to wrong account end of month 10/31/2023$765.3 -$13.0 -$4.8 $747.5 Brandywine and DIT settlement 11/30/2023$747.5 $0.0 $21.5 $768.9 12/31/2023$768.9 $0.0 $22.2 $791.2 1/31/2024$791.2 $0.0 -$0.5 $790.7 2/29/2024$790.7 $0.0 $19.7 $810.4 3/31/2024$810.4 $0.0 $17.1 $827.5 4/30/2024$827.5 $0.0 -$16.0 $811.4 5/31/2024$811.4 $0.0 $13.1 $824.5 6/30/2024$824.5 $0.0 $4.0 $828.5 7/31/2024$828.5 $0.0 $6.2 $834.7 8/31/2024$834.7 $0.0 $10.1 $844.8 9/30/2024$844.8 $3.6 $14.5 $863.0 DIT settlement 10/31/2024$863.0 $0.0 $0.2 $863.1 11/30/2024$863.1 $0.0 $20.8 $883.9 12/31/2024$883.9 -$5.0 -$17.9 $861.0 DIT settlement 1/31/2025$861.0 $0.0 $10.6 $871.6 2/28/2025$871.6 $0.0 -$2.8 $868.8 3/31/2025$868.8 $0.0 -$11.9 $856.9 4/30/2025$856.9 $0.0 $6.0 $862.9 5/31/2025$862.9 $0.0 $16.5 $879.5 6/30/2025$879.5 -$4.5 $17.3 $892.2 DIT settlement 7/31/2025$892.2 $0.0 $12.2 $904.5 8/31/2025$904.5 $0.0 $6.8 $911.2 9/30/2025$911.2 -$8.8 $9.1 $911.5 Athletics Quasi Endowment Transfer 10/31/2025$911.5 $0.0 $2.5 $914.0 11/30/2025$914.0 $4.6 $0.2 $918.9 Alumni Transfer November Investment Update Prepared by University of Wyoming Foundation Investment Staff 5 Pool Cash: Below is the cash balance as far as we have visibility: !\"#ABCDA\"CEFAB*H!IC!-\" F.CA*.BLEMN-O*.BLEP.N.\"*A !\"#A BCDBDCECF GHIHFJIEKE #LM! BCDBDCECFGCIENEIOKP GNIKPFIEJJ LA4R!STU\"RTMVWX BCDCDCECFGBIEEEIEEEGOIKPFIEJJ YVU4#R=\"UTR=\"#\"==4RSU! BCDCDCECFGBIEEEIEEEGBEIKPFIEJJ MV==SU#RSU! BCDCDCECFGCIEEEIEEEGBCIKPFIEJJ !4UL4MXVSULR4U4MT>RSU! BCDCDCECFGBIEEEIEEEGBPIKPFIEJJ \"TM44RM4\"=L>R!VMX BCDCDCECFGCIEEEIEEEGBFIKPFIEJJ !?M4RTMVWXRSU!R@R\" BCDPDCECFGBIEEEIEEEGBHIKPFIEJJ X=\"SU#R\"==R\"A4MRXSX4=SU4R=X BCDPDCECFGCIEEEIEEEGBNIKPFIEJJ B!4=R4U4MT>RSU! BCDJDCECFGBIEEEIEEEGBOIKPFIEJJ 4U4MT>RLM\"U#C4MR=X BCDJDCECFGCIEEEIEEEGCBIKPFIEJJ 4U4MT>RLM\"U#C4MR=X BCDJDCECFGCIEEEIEEEGCPIKPFIEJJ MV!DE4==R\"WLVA\"LSVURSU! BCDFDCECFGBICFEIEEEGCJIONFIEJJ CW#4RCWUFRSS BCDFDCECFGGCFEIEEEHGCJIKPFIEJJ #LVU4RMSFT4RCWUFRSSS BCDFDCECFGGKIEEEIEEEHGBKIKPFIEJJ A!!VMAS!DRIR!V@UVURJLTR#AM# BCDNDCECFGBIEEEIEEEGBNIKPFIEJJ A!!VMAS!DRIR!V@UVURJLTR#AM# BCDNDCECFGBIEEEIEEEGBOIKPFIEJJ !4UL4MXVSULR4U4MT>RSU! BCDBEDCECFGCIEEEIEEEGCBIKPFIEJJ MSJ4MRJSSS BCDBEDCECFGGNJIKNCH GCBIHFEICHB =PA\"MMS#RL4!AUV=VTS4#RSU! BCDBCDCECFGBIEEEIEEEGCCIHFEICHB M4XW?=S!R#4MJS!4#RSU! BCDBCDCECFGCIEEEIEEEGCJIHFEICHB November Investment Update Prepared by University of Wyoming Foundation Investment Staff 6 Short-Term Bond Fund: !\"#A\"B\"CDEF*+I-.*LBEME1I.LCEO3L4 F*C35ST5TS8S9 !\"#ABCDEFGA+I#J.LMMNOMP4RST 4R44T.4 4R44T4ROU 4R4!\"#ABC9A#WCXAYI#JZ.>44N?>?4R>T ORS4T.PN4O@ORS4T4ROU 4R4AIGZ+CB#+FGZ+A+FC9A#W.CNLOP4R4T 4RO4T.C 4RO4T4R4U 4R4O.C*WEME;*Y=+ .?PMNLS@4RCT 4R?4T.PN4@O4R?4T4R@U 4R4aXC9A#WCbbACcCAdeff.PNP@ONPOO?R4T LR??T.@CCN>@MLR??TOR?U 4R4gh+GIAGiBM .OON444N444OORSTOLRO@T.ONSSLNPLPOLR>4T@R>UOC?R>9I+i\"I#MM .SN>OONP4CSRPT 4R44T.4 4R44TOR4U 4R4k\"llFGiIAhCmAEFG.>4NCL4NCSP>@RMT SR4OT.@N4LCNCP?SR4OTOORMUOSRS!ggg .MN@4>N?O?MRST SRMLT.@?PN@L4SRMLTORSU 4R4k\"GE\"GA+F .4 4R4T 4R44T.4 4R44T4R4U 4R4aXCnGFAZoGpC9Ihh.CN?M?NSOOO4R@T LR?PT.L?@NO44LR?PT@RLU MLRSmGFTFGGFrZ .>NMSSNPOM>R?T OOR@4T.ML@N4@>OORLPTORLU1I.LCEO3L4E>??.AYC.C>N??LNLO@CCROT >R>MT.>N4?SN>CM>RM@T@ORCUL?R?O.C*W @ABCa9ACB9b588c8d9c9Sd@9C8A5CB5a9c9edSSc5fbecgMb\"#+BhpCrIZ+GIso+I\"#CA##oAhItFr uv\"Cgh+GIAGiB8c8MM9I+i\"I#CIZC#\"+CI#ihorFrCI#C+BFCpIFhrCiAhiohA+I\"# 1I.LCMO3L4EhAYBEi.4M.+\"C\".Y;*Y=+E*YBE1I.LCEO3L4MkYlW.m+E*YBEnAClW.m+ o\"3WBE*CEi.+C5SEp.cEOL*Y+l3LEi.q3L*r3E>qrsE@gCbabCe5B FAL*C\".YEtF*D+ui*+IEvEw#A\"q*W3YC+;*W*Y?3x3\"rICp*L=3CEo\"3WBp*L=3CEo\"3WBEfE;*W*Y?3 kAZBNC?R>T gh+GIAGiBNCO@R4T k\"llFGiIAhCmAEFGNC>>RPT !gggNCMR?T aXCnGFAZoGpC9IhhNCO4R?T mGFTFGGFrZNCMR@T .Cbb .@Cbb .SCbb .MCbb .?Cbb .O4Cbb .O@Cbb goJc@LXFEc@LDi+c@LZ\"Yc@LxFic@L!A#c@SAFsc@SbAGc@SgEGc@SbApc@S!o#c@S!ohc@SgoJc@SXFEc@SDi+c@SZ\"Yc@SxFic@S!A#c@>AFsc@>bAGc@>gEGc@>bApc@>!o#c@>!ohc@>goJc@>XFEc@>Di+c@>Z\"Yc@> auCnygZXAzyCcCDanA^DuAgkB^Bn_CnygZXAzyXCcCDanA^DuBZA^DuX November Investment Update Prepared by University of Wyoming Foundation Investment Staff 7 Private Market Cash Flows: Best, Philip Treick, Chief Investment Officer Joe Briones, Analyst / Portfolio Manager Hazen Dickerson, Analyst / Portfolio Manager Mac Festa, Investment Analyst Levi Johnson, Investment Intern Nolan Nachbar, Investment Intern !\"#$%\"CD!\"CC(D)*+ ,$(%-$./%$01(D)*+ !\"#A%&D()#*\")\"+A, !\"#A %&D()#*\")\"+A, !!\"#\"A%CD!AE%FFG+IIII -KKLMMINLOPQRLISTRPOLRMINEIUVSV!!\"#\"AFA%!WWEA#X+IIII Y=>I?LT@IAMPTPLISTRPOLRMIBQOCI>NIUabaPLC !!\"!A\"A%CX!E!WcG+IIIIII d@efT@I>OgRTMPRQKPQRLISTRPOLRMI>NEIUVSV!!\"%\"AFA%!E##hEWhh+I ?LMeQRKLI=TiaPT@IBQOCIN>>EIUVSV !!\"AF\"A%CAEch%EFFFG+I Mk>SIlQ@Pam?LMITOCI>OCQMPRaT@IBQOCICnSGEIUVSV!!\"W\"AFA%A%FE!WF+IIII -P@TMINLOPQRLIoiieRPQOaPpIBQOCI> !!\"A#\"A%CchEAFcG+IIIIII qKT@LINLOPQRLISTRPOLRMIN>>EIUVSV!!\"!#\"AFA%!cEXA#+IIIIII AO=TiIAOLRrpI=TiaPT@IBQOCIs>EIUVSV !!\"A%\"A%CAEFFFEFFFG+I =@LTRIoiieRPQOaPaLMIBQOCI>>!!\"!#\"AFA%WDEF##+IIIIII k?-IdRetPuITOCI>OKebLIBQOCIsEIUU= !!\"!#\"AFA%AAXEA#F+IIII =>Y>=I=TiaPT@I=uaOTISTRPOLRMI>NEIUVSV !!\"!h\"AFA%AhE!cA+IIIIII BeRPRLMMI=RLCaPIoiieRPQOaPaLMIBQOCI>NEIUVSV !!\"!c\"AFA%!WAE##F+IIII ?eKYieaOPI?LT@IAMPTPLIBQOCIN>EIUVSV !!\"!X\"AFA%AhE!A#+IIIIII BeRPRLMMI=RLCaPIoiieRPQOaPaLMIBQOCI>>>EIUVSV !!\"!X\"AFA%XFE%hW+IIIIII o-wY?AAI=UoIAnx>YyIBx]kI>EIUVSV !!\"AF\"AFA%WFE%WF+IIIIII oRaeOIlaOLIBaOTOKLICkL@TtTRLGIBQOCI>>EIUS !!\"AF\"AFA%!EFchE!A!+I -KPaMId@efT@I# !!\"A!\"AFA%%!AE!%h+IIII A^LPLRI>OCQMPRaT@INT@QLIBQOCIN !!\"A#\"AFA%##EFD!+IIIIII =uTR@LMfTOYIA_QaPpIBQOCI>s !!\"AW\"AFA%#AEchA+IIIIII YRa@TOPaKI=TiaPT@ISTRPOLRMIN>IC]eRPuI-bLRaKTGEIUVSV !!\"Ah\"AFA%!E%XDEXWA+I -QrQMPIA_QaPpISTRPOLRMINm-VIUVSV -.LM1.LO31456 T8T%9 .LO:MLM;O56 T8T%9"}
